[
  {
    "moc_id": "8919",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Command Financial Specialist (CFS) shall function as the command's principal advisor on policies and matters related to Personal Financial Management (PFM). CFSs are nominated by their commands as special assistants to senior leadership. They help others with car buying, checking account management, credit and bankruptcy, and financial planning.",
    "moc_key": "cfs_comm_fin_spec_mc",
    "moc_code": "CFS_COMM_FIN_SPEC_MC",
    "moc_title": "CFS - Command Financial Specialist",
    "moc_full_title": "CFS - Command Financial Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6667",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Disaster Preparedness Specialist plans, develops and administers the command's disaster preparedness program. Advises command on how to integrate organizational functions necessary to prepare for, defend against, and recover from major accidents, both natural and man-made disasters; assists in the coordination with local, state, and federal authorities on disaster response operations.</p>\r\n<p>Other duties may include, conducting training for nuclear, biological, and chemical (NBC) warfare defense, hazard awareness, individual protection, decontamination, and mission restoration; may perform organizational maintenance on NBC defense equipment; uses equipment complying with procedures required by Nuclear Regulatory Commission license.</p>",
    "moc_key": "dps",
    "moc_code": "DPS",
    "moc_title": "Disaster Preparedness Specialist",
    "moc_full_title": "Disaster Preparedness Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6665",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Force Fitness Instructors (FFI) provide the tools and motivation to help their Marines maintain a healthy physical fitness program, succeed physically, and maintain good health. FFI’s seek to establish a Corps-wide culture of a total fitness program utilizing the Marine Corps Physical Fitness Program (MCPFP) which is designed to use the latest scientifically-based techniques and modern technology in the sports medicine field. FFI’s prepare a Marine’s body to meet the minimum requirement for active duty as well as provide guidance to command members on proper nutrition, weight management, physical conditioning, test safety, scheduling, administering, monitoring, and reporting on Physical Fitness Assessments (PFA). Each command is required to have one FFI and one assistant (AFFI).",
    "moc_key": "ffi",
    "moc_code": "FFI",
    "moc_title": "FFI - Force Fitness Instructor",
    "moc_full_title": "FFI - Force Fitness Instructor",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6671",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Instructors teach and share their experiences with other Marines. They help Marines and others who want to learn the knowledge, skills, and abilities the Marine Corps requires them to perform as part of their duties, assignments, or positions. The Marine Corps Instructor provides lectures, helps others prepare for presentations, and works to showcase the ability and talent of Marines. Marine Corps Infantry Instructors also teach and mentor students based on lessons learned as well as write course outlines/curriculum.  </p>",
    "moc_key": "ii",
    "moc_code": "II",
    "moc_title": "Instructor",
    "moc_full_title": "Instructor",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6582",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Marine Corps has a long, rich heritage of developing leaders to assume progressively greater responsibilities in the Marine Corps and in society. Marine Corps leadership development focuses on character, competence and the internalization of our Core Values. Marine Corps leaders are developed through tough, realistic training, experience, and by the personal example of leaders who embody what it means to be a Marine.<br /><br /><a title=\"External link to: Lejeune Leadership Institute\" href=\"https://www.usmcu.edu/lli/\" target=\"_blank\">Lejeune Leadership Institute</a> - Marine Corps Leadership Development<br /><br />The most important responsibility in our Corps is leading Marines. If we expect Marines to lead and if we expect Marines to follow, we must provide the education of the heart and of the mind to win on the battlefield and in the barracks, in war and in peace. Traditionally, that education has taken many forms, often handed down from Marine to Marine, by word of mouth and by example…<br />The indispensable condition of Marine Corps leadership is action and attitude, not words. As one Marine leader said, \"Don't tell me how good you are. Show me!\"<br /><br /><a title=\"External link to: MCWP 6-10, Leading Marines\" href=\"https://www.marines.mil/News/Publications/MCPEL/Electronic-Library-Display/Article/899578/mcwp-6-10/\" target=\"_blank\">MCWP 6-10, Leading Marines</a>",
    "moc_key": "leader_mc",
    "moc_code": "LEADER_MC",
    "moc_title": "Leader",
    "moc_full_title": "Leader",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7543",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Various infantry billets require Infantrymen to plan, conduct, and supervise logistics and embarkation for all unit-level logistics and embarkation requirements. They coordinate all combat logistics functions, sustain unit level logistics as well as attached units during training and combat environments. </p>\r\n<p>Infantryman prepares supplies and equipment for embarkation and performs various functions to support the movement of personnel, supplies, and equipment via all modes of transportation.  Infantryman also performs multiple logistical administrative duties and coordinate with G/S-4 sections. They compile and maintain logistics support data, compute combat logistics support requirements, and coordinate combat logistics functions in support of MAGTF operations and deployments. </p>",
    "moc_key": "lg",
    "moc_code": "LG",
    "moc_title": "Logistics",
    "moc_full_title": "Logistics",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "8758",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Marine Security Guard (MSG) will be assigned to duty to one of 140 plus MSG detachments around the world. The MSG will provide armed internal security to designated U.S. diplomatic and consular facilities to prevent the compromise of classified information and equipment vital to the national security of the United States. As part of the MSG detachment, the detachment member's secondary mission is to provide protection for U.S. citizens and U.S. government property located within designated U.S. diplomatic and consular premises during exigent circumstances, which require immediate aid or action. The detachment member will be physically and mentally capable of enduring a direct counter-intelligence and combat environment, master interior guard procedures, be proficient with security, anti-terrorism, and counter espionage tactics. The MSG member must also be knowledgeable in law enforcement techniques, small arms handling and employment, emergency first aide, force continuum, less than lethal application, and entry and access control procedures.",
    "moc_key": "msg",
    "moc_code": "MSG",
    "moc_title": "Marine Security Guard",
    "moc_full_title": "Marine Security Guard",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "8764",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Military Drivers are individuals who possess the necessary training, education and licensure to operate a wide range of military vehicles. Service Members assigned as drivers may perform driving duties within either a tactical or non-tactical environment operating vehicles with a Gross Vehicle Weight Rating (GVWR) of at least 26,001 pounds. Typical duties of military drivers include convoy operations, tactical patrols, logistics, passenger transport, and the hauling of double/triple trailers.  </p>\r\n<p>The Military Drivers credentialing opportunities are open to all Marines that possess the required training and Military licenses to qualify for the Commercial Driver’s License (CDL) and the Transportation Worker Identification Credential (TWIC) licenses. </p>\r\n<p>To get a CDL, first a candidate must get a commercial learner's permit. States can only issue learner's permits and CDLs to drivers after they pass knowledge exams and skills tests. Candidates must pass the CDL knowledge and skills tests for the class of license and type of endorsement required to operate the type of commercial vehicle they plan to drive. And, candidates must take the skills test in a vehicle of the same type as the vehicle they plan to operate.  </p>\r\n<p>For a quick reference of CDL Classes, see the <a title=\"Click for COOL CDL License Matrix\" href=\"../cert_related/CDL_Lic_Matrix.pdf\" target=\"popup\">CDL License Matrix</a>. <br /><br />More information can be found on the certifying agency's website.</p>",
    "moc_key": "md",
    "moc_code": "MD",
    "moc_title": "Military Drivers",
    "moc_full_title": "Military Drivers",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6664",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Physical Security personnel are active duty Service members that perform embassy, base, and theater security during contingencies, terrorist attacks, natural disasters, civil disturbances, exercises and special events that require heightened levels of security.</p>\r\n<p>Physical Security team members participate in maritime interdiction, boarding actions, and tactics that are designed to capture enemy vessels, combat terrorism, piracy and smuggling, and to conduct customs and safety checks, and other inspections.</p>",
    "moc_key": "ps",
    "moc_code": "PS",
    "moc_title": "Physical Security",
    "moc_full_title": "Physical Security",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6663",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Preventive maintenance is performed to ensure equipment and facilities are kept in satisfactory operating condition. The main goal is to preserve and restore equipment reliability by replacing worn components before they fail. Preventive maintenance procedures performed are instrumental, including tests, measurements, adjustments, and parts replacement. Preventive maintenance activities include systematic inspections, detection, correction of incipient failures, partial or complete overhauls at specified periods, oil changes, and lubrication. In addition, workers record equipment deterioration to closely track when to replace or repair worn parts to prevent them from causing system failure.",
    "moc_key": "pm",
    "moc_code": "PM",
    "moc_title": "Preventive Maintenance",
    "moc_full_title": "Preventive Maintenance",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6666",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Substance Abuse and Alcohol Counseling Specialists (SACS) provide substance abuse education/prevention, assistance to the commanding officer on substance abuse related matters, and urinalysis screening. SACS also provide Marine Corps units with basic individual Manpower Professional Military Education (PME), briefings, routine direction and supervision. Other duties may include, conducting screening and assessment interviews, individual and group counseling, and referral activities, developing treatment and continue care plans, maintaining progress notes, preparing summary reports, and providing crisis intervention, referrals, consultations, and educational services. Drug and Alcohol Counselors are charged with maintaining the highest code of standards as required by the Counselor Code of Ethics as well as current knowledge about the field of addictive-illness counseling. </p>",
    "moc_key": "sacs",
    "moc_code": "SACS",
    "moc_title": "SACS - Substance Abuse and Alcohol Counseling Specialist",
    "moc_full_title": "SACS - Substance Abuse and Alcohol Counseling Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6669",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Safety Officer ensures the overall safe conduct of training. They perform both management and administrative functions by maintaining written logs of pertinent safety and control data. Identify hazards, unsafe work practices, and health hazardous conditions; ensure hazardous materials are safely handled, transported, stored, and accounted for. They prepare various safety and mishap reports, maintain hazard abatement program documentation, and aid in mishap investigations.</p>",
    "moc_key": "so",
    "moc_code": "SO",
    "moc_title": "Safety Officer",
    "moc_full_title": "Safety Officer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6668",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Special Warfare/Reconnaissance Medic provides pre-hospital medical care in support of Special Warfare training and operations, or for Marine Reconnaissance personnel involved in direct action or reconnaissance operations. Perform basic and advanced first aid, life support, tactical combat casualty care, tactical medical emergencies, and other para-medicine emergency care independently of a medical officer. Perform duties using open and closed circuit SCUBA in direct support of Special Operations or Fleet Marine Force (FMF) Reconnaissance Units. Knows the laws of diving; understands the theory and practice of decompression and the use of decompression tables. Provides emergency care to diving causalities and enters hyperbaric chambers to serve as inside tender to care for patients undergoing hyperbaric treatment.</p>",
    "moc_key": "swrm",
    "moc_code": "SWRM",
    "moc_title": "Special Warfare/Reconnaissance Medic",
    "moc_full_title": "Special Warfare/Reconnaissance Medic",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6670",
    "moc_codetype": "DUTY",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "<p>Unmanned Aerial Vehicle - Operator<strong> </strong>(UAV-O) serve as external pilots and directly control the flight of the Unmanned Aerial Vehicle (UAV) during launch and recovery operations by visual reference to the UAV’s. External pilots operate and navigate UAVs during the route, mission, and return phases of flight.</p>",
    "moc_key": "uav_o",
    "moc_code": "UAV_O",
    "moc_title": "Unmanned Aerial Vehicle - Operator",
    "moc_full_title": "Unmanned Aerial Vehicle - Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6300",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Administrative Specialist responsibilities include the management of administrative and clerical functions in the areas of general administration, personnel administration, operational administration, and manpower administration.  The required qualifications include basic clerical and communication skills.  Administrative Specialists are required to learn administrative procedures and processes, pay and personnel information, preparation of orders and directives, correspondence, and the use and maintenance of filing systems.  There are a wide variety of billets available in this MOS ranging from duty at the staff level in the operational, garrison, joint duty assignments and the opportunity to serve on independent duty in support of the Selected Marine Corps Reserve (SMCR).\n",
    "moc_key": "0111",
    "moc_code": "0111",
    "moc_title": "Administrative Specialist",
    "moc_full_title": "0111 - Administrative Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6303",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Postal Clerks perform all duties necessary to the efficient operation of a Marine Corps Post Office.  Mail handling duties can include, but are not limited to accepting, sorting, manifesting and dispatching all types of mail, to include official mail.  Postal Clerks also issue and cash USPS money orders, sell stamps, apply postage to, and mail out parcels.  They perform any other duties in connection with the proper running of a postal operation.  Only Postal Marines receiving formal training as listed in the prerequisites and assigned to a military postal facility, may be given this MOS.  Postal Clerks will not be assigned to unit mailrooms to conduct mail clerk/orderly functions.\n",
    "moc_key": "0161",
    "moc_code": "0161",
    "moc_title": "Postal Clerk",
    "moc_full_title": "0161 - Postal Clerk",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6305",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "CI/HUMINT Specialists are involved in all facets of planning and conducting HUMINT operations, CI activities, and sensitive activities (SA). CI/HUMINT Specialists require specialization in the development and coordination of multi-use networks. They are expected to possess a working knowledge of the organization, operations, and techniques employed by foreign intelligence services, international terrorist organizations, insider threats, and other CI threats. CI/HUMINT Specialists conduct sensitive and non-sensitive HUMINT operations in Joint Operations Area (JOA) and Non-JOA environments to support MEF priorities, MAGTF operations, and service requirements. They also conduct CI functional services, CI collection activities, CI incident assessments, and CI analysis in support of MEF equities, MAGTF operations, the MCISRE, CCMDs, & USMC/DoN critical infrastructure/critical programs and technology. CI/HUMINT Marines obtaining a qualifying DLAB score can receive language training.\n",
    "moc_key": "0211",
    "moc_code": "0211",
    "moc_title": "Counterintelligence/Human Intelligence (CI/HUMINT) Specialist",
    "moc_full_title": "0211 - Counterintelligence/Human Intelligence (CI/HUMINT) Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6307",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "MOS 0231, Intelligence Specialist is an entry level primary MOS. Intelligence Specialists are familiar with all phases and facets of intelligence operations. Typical duties of Intelligence Specialists include researching, filtering, recording, analyzing, producing, and disseminating information and intelligence. The Intelligence Specialist, may supervise intelligence sections up to and including infantry regiments, Marine Aircraft Group (MAG) and Marine Expeditionary Unit (MEU). Additionally, depending on rank and billet assignment, Intelligence Specialists duties may include Collection Requirements Management (CRM), targeting, target production, Intelligence Analyst, Intelligence Operations Chief, Company Level Intelligence Cell (CLIC) Chief, Open Source Intelligence (OSINT) Analyst, MAGTF Information Group (MIG) Assistant Operations Chief, and Targeting Cell Analyst at various echelons of command within the Fleet Marine Force (FMF) and supporting establishment (SE). Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0231",
    "moc_code": "0231",
    "moc_title": "Intelligence Specialist",
    "moc_full_title": "0231 - Intelligence Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6308",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "MOS 0241, Imagery Intelligence Specialist is an entry-level primary MOS. Imagery Intelligence Specialists exploit and analyze imagery gathered by various space-based or airborne platforms and sensors. Sensors may include infrared, lasers, electro-optics, and radar. Utilizing photogrammetric skills and a suite of software tools, analysts derive critical information and create a variety of imagery intelligence products. These products support the commanders decision-making process by reducing uncertainty about the, situation, environment, and enemy forces.\n",
    "moc_key": "0241",
    "moc_code": "0241",
    "moc_title": "Imagery Analysis Specialist",
    "moc_full_title": "0241 - Imagery Analysis Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6309",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "MOS 0261, Geospatial Intelligence Specialist is an entry level primary MOS. Geospatial Intelligence Specialists are involved in all activities that are related to the planning, processing, analysis, exploitation, and dissemination of spatial information that is used to gain intelligence concerning the operational environment. These specialists are expected to provide timely, relevant, and accurate geospatial intelligence for planning, decision-making, and action in support of Marine Corps, Joint, and Combined Operations. Using data regarding, terrain, inland and coastal water, climatology, meteorology, and cultural intelligence, geospatial intelligence specialists are able to visually depict this information and fuse it with other information through analysis to display a single, comprehensive picture of the operational area for the commander.\n",
    "moc_key": "0261",
    "moc_code": "0261",
    "moc_title": "Geospatial Intelligence Specialist",
    "moc_full_title": "0261 - Geospatial Intelligence Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6310",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Intelligence Chiefs serve as the senior enlisted 02XX intelligence professionals in the Marine Corps Intelligence Surveillance and Reconnaissance Enterprise. They facilitate the production of actionable intelligence by applying subject matter expertise and technical acumen to all manner of intelligence problem sets. Intelligence chiefs ensure seamless integration of national intelligence capabilities by leveraging the national intelligence-mandated combat support agencies to achieve operational objectives. Intelligence Chiefs also advise commanders and intelligence officers on the proper utilization and deployment of intelligence personnel and guide the professional development of the enlisted intelligence workforce at all echelons of the Fleet Marine Force, supporting establishment and Joint Force. Intelligence Chiefs can serve in various roles including, but not limited to: Command Senior Enlisted Leader (CSEL) at the Defense Intelligence Agency, CSEL at the National Security Agency, as the Senior Enlisted Leader for a Joint Director, J2 at a Geographic Combatant Command, the Senior Enlisted Advisor to the Marine Corps Director of Intelligence, the CSEL of Marine Corps Intelligence Activity, the CSEL of Marine Corps Intelligence Schools, as the Intelligence Chief of a Marine Force Level Command, Marine Expeditionary Force or major subordinate command, as the Intelligence Chief of Marine Corps Tactics and Operations Group or in other roles as required by the Deputy Commandant, Manpower and Reserve Affairs. This MOS will be assigned and voided only by the authority of the CMC (MM).\n",
    "moc_key": "0291",
    "moc_code": "0291",
    "moc_title": "Intelligence Chief",
    "moc_full_title": "0291 - Intelligence Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6311",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Rifleman employs the M4 Service Rifle, the M320 Grenade Launcher, the M3E1 multi-purpose anti-armor anti-personnel weapons system (MAAWS), and the M27 Infantry Automatic Rifle (IAR). Riflemen are the primary scouts, assault, and close combat forces available to the MAGTF. They are the foundation of the marine infantry organization, and as such are the nucleus of the fire team in the rifle squad, the scout team in the LAR squad, and scout platoons in the infantry battalion. Noncommissioned officers are assigned as fire team leaders, scout team leaders, and rifle squad leaders.\n",
    "moc_key": "0311",
    "moc_code": "0311",
    "moc_title": "Rifleman",
    "moc_full_title": "0311 - Rifleman",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6313",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Light Armored Reconnaissance (LAR) Marine is an infantry Marine skilled in Armored Reconnaissance. In addition to basic infantry skills, they are knowledgeable in armored reconnaissance and surveillance, and armored security missions in support of the MAGTF to gain information on the enemy and terrain. LAR Marines provide gunnery and weapons skills for the employment of the 25mm Chain Gun, the Coaxial and Pintle-Mounted 7.62mm Machineguns and thermal optics on the LAV-25 variant. LAR Marines receive advanced training as vehicle operators, LAV-25 Gunners, LAR Vehicle Commanders and LAR Master Gunners. Non-Commissioned Officers are assigned as LAV-25 Gunners and Vehicle Commanders.\n",
    "moc_key": "0313",
    "moc_code": "0313",
    "moc_title": "Light Armored Reconnaissance Marine",
    "moc_full_title": "0313 - Light Armored Reconnaissance Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6314",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Reconnaissance Marine is a Marine skilled in multi-domain reconnaissance & surveillance. In addition to basic rifleman skills, Reconnaissance Marines possess enhanced physical and psychological attributes required to gain access to the operational environment and are required to maintain advanced capabilities in combat swimming, small boat operations, highly-refined scouting and long range patrolling, close combat skills, demolitions, forward observer procedures for supporting arms, ITG operations for heliborne, airborne, and waterborne forces; long-range communications, multi-domain collections, threat weapons and equipment identification. All Reconnaissance Marines receive advanced training in survival escape resistance evasion (SERE), low level static line (LLSL) parachuting, military freefall parachuting, and combatant diving. They are also trained as a subject matter expert in advanced communications, special weapons, joint terminal attack control, helicopter rope insertion/extraction techniques, assault climbing, intelligence collection, mountain warfare, methods of entry, sniper operations, advanced combat life support, close quarter tactics, and may serve as jumpmasters and dive supervisors depending on their billet in the reconnaissance unit. Reconnaissance Marines contribute to the multi-domain collection of intelligence at the tactical, operational, and strategic echelons of command. They are highly capable of conducting low visibility missions in environments ranging from cooperation to conflict. Supporting the fleet Marine Force, fleet, or joint task force, Reconnaissance Marines provide timely intelligence to the supported commander to shape and influence the operational environment. The varying types of missions a Reconnaissance Marine conducts are multi-domain reconnaissance and surveillance, battle space shaping, and other special reconnaissance missions.\n",
    "moc_key": "0321",
    "moc_code": "0321",
    "moc_title": "Reconnaissance Marine",
    "moc_full_title": "0321 - Reconnaissance Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6315",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Machine Gunner is responsible for the tactical employment of the light, medium, and heavy Machine-Gun, and their support vehicle. Machine Gunners provide direct fire in support of the infantry rifle squads/platoons/companies. They are located in the weapons platoons of the rifle and weapons company in the infantry battalion. Noncommissioned officers are assigned as team leaders and squad leaders/section leaders.\n",
    "moc_key": "0331",
    "moc_code": "0331",
    "moc_title": "Machine Gunner",
    "moc_full_title": "0331 - Machine Gunner",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6316",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Mortarmen are responsible for the tactical employment of the Light and Medium Mortar systems. Mortarmen provide indirect fire in support to the rifle and LAR squads/platoons/companies and also the infantry and LAR battalions. They are located in the weapons platoon of the rifle companies, 81mm mortar platoons of the weapons companies, and LAR companies. Noncommissioned officers are assigned as mortar gunners, forward observers, fire direction plotters, and squad and section leaders.\n",
    "moc_key": "0341",
    "moc_code": "0341",
    "moc_title": "Mortarman",
    "moc_full_title": "0341 - Mortarman",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6318",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Antitank Missile Gunner is responsible for the tactical employment of the M41A7 Improved Target Acquisition System (ITAS) Saber and M98A1 Javelin Weapons System during anti-armor operations and tactical vehicle operations. They provide medium and heavy anti-armor fire in support of the infantry battalion, LAR battalion, and the MAGTF. They are located in the anti-armor platoon within the weapons company of the infantry battalions and LAR battalions. Noncommissioned officers are assigned as gunners and squad leaders.\n",
    "moc_key": "0352",
    "moc_code": "0352",
    "moc_title": "Antitank Missile Gunner",
    "moc_full_title": "0352 - Antitank Missile Gunner",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6652",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Light Armored Reconnaissance (LAR) Unit Leader serves as the enlisted technical and tactical advisor to the LAR unit commander.  He/She assists the commander with all aspects of the planning, training, employment, logistical support, maintenance, accountability, welfare, and administrative functions in support of the LAR unit’s mission.  He/She controls the employment of his vehicle and section within the unit and assists with the coordination and implementation of supporting arms.  He/She supervises and coordinates the performance of maintenance, maintenance management, embarkation, and recovery operations.  Staff sergeants are employed as LAR platoon sergeants and gunnery sergeants are employed as LAR Company Operation Chiefs.\n",
    "moc_key": "0363",
    "moc_code": "0363",
    "moc_title": "Light Armored Reconnaissance (LAR) Unit Leader",
    "moc_full_title": "0363 - Light Armored Reconnaissance (LAR) Unit Leader",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6319",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Infantry Unit Leader is responsible to the commander and assists in the planning, training, deployment and employment of all infantry organic weapons systems and the units combat power capabilities. They supervise and coordinate the preparation and assignment of personnel/ equipment in accordance with the Table of Organization/Table of Equipment of their unit. Supervises the establishment and operation of unit command and control to include the integration and synchronization of the warfighting functions.\n",
    "moc_key": "0369",
    "moc_code": "0369",
    "moc_title": "Infantry Unit Leader",
    "moc_full_title": "0369 - Infantry Unit Leader",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6320",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Critical Skills Operator (CSO) is a US Marine who is trained to execute missions in within the following special operations core activities assigned by USSOCOM:  direct action (DA); special reconnaissance (SR); countering weapons of mass destruction (CWMD); counterterrorism (CT); unconventional warfare (UW); foreign internal defense (FID); security force assistance (SFA); and counterinsurgency (COIN).  The CSO is capable of being independently employed or rapidly integrated within the Joint Force.  As part of a command team within the O4 level and above, the MGySgt or MSgt CSO is designated billets as the Special Operations Forces Senior Enlisted Advisor (SOFSEA).  The MGySgt CSO can also serve as a Command Senior Enlisted Leader (CSEL) in designated combined, joint, and SOF billets (Examples:  combined joint special operations task force (CJSOTF), special operations task force (SOTF), and theater special operations command (TSOC)).\n",
    "moc_key": "0372",
    "moc_code": "0372",
    "moc_title": "Critical Skills Operator",
    "moc_full_title": "0372 - Critical Skills Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6653",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Light Armored Reconnaissance Operations Chief (LAR Ops chief) serves as the senior enlisted tactical advisor to the commander and staff of a light armored reconnaissance (LAR) company or battalion. They advise the commander in the tactical employment of the organic weapons systems of the unit, the condition, care, and economical use of unit resources and equipment. They coordinate and supervise all aspects of the company or battalion combat operations center (COC) or administrative logistics operations center (ALOC). They ensure that personnel are trained and proficient in the employment of C4I systems and manages the flow of information provided through them. They assist with the timely collection, review, and distribution of orders, messages, briefs, reports, training schedules and all tasks in support of the units core and assigned mission essential tasks. The LAR Operations Chief advises and makes recommendations for the planning, coordination, and execution of the units fire support plan. They manage the 03XX personnel within the unit, in order to minimize crew turbulence amongst formed and trained crews, assists with the development of the units training plan, and managing the unit readiness program. They coordinate and supervise the embarkation and debarkation of the unit. Master Sergeants are assigned as battalion logistics chiefs, assistant battalion operations chiefs, and headquarters & service company operations chiefs. Master Gunnery Sergeants are assigned as A/C and R/C battalion operations chiefs, Marine Corps warfighting lab (MCWL) operations chief, Marine air ground task force-training center (MAGTF-TC) operations chief, program manager-light armored vehicle (PM-LAV) operations advisor, and plans, policies, and operations (PP&O) LAR advocate/OccFld sponsor.\n",
    "moc_key": "0393",
    "moc_code": "0393",
    "moc_title": "Light Armored Reconnaissance (LAR) Operations Chief",
    "moc_full_title": "0393 - Light Armored Reconnaissance (LAR) Operations Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7621",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Operations Chief is responsible to the commander and assists in all levels of planning, training, deployment and employment of MAGTF capabilities to include the integration and synchronization of the warfighting functions. Supervises and coordinates the preparation and assignment of all personnel/equipment supporting each warfighting function in accordance with the Table of Organization/Table of Equipment of their unit. The Operations Chief assists unit readiness by recording evaluations and training readiness task completion within program of record systems. The Operations Chief is responsible to facilitate and develop concepts of employment for new and emerging technologies fielded to the Marine Corps. The Operations Chief establishes Operation Posts, supervises information management and assists in operation of unit command and control.\n",
    "moc_key": "0399",
    "moc_code": "0399",
    "moc_title": "Operations Chief",
    "moc_full_title": "0399 - Operations Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6321",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Maintenance Management Specialist provides advice, guidance, and assistance to the unit's equipment commodity/section managers and maintenance personnel to ensure a systematic approach to maintenance operations of ground equipment.  The Maintenance Management Specialist supervises maintenance management and maintenance personnel in monitoring and reporting of maintenance management policy, programs, procedures and maintenance automated information system (MAIS) requirements and analyzes, maintenance management functional elements/areas, maintenance production functions, and maintenance engineering actions in support of equipment Total Lifecycle Systems Management (TLCSM) efforts.  When serving in the capacity of the Maintenance Management Officer, coordinates the commander's interest, resources, production, and information requirements in operational planning to ensure effective management of personnel, equipment, maintenance, and materiel to meet operational objectives.\n",
    "moc_key": "0411",
    "moc_code": "0411",
    "moc_title": "Maintenance Management Specialist",
    "moc_full_title": "0411 - Maintenance Management Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6322",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Logistics/Embarkation Specialist prepares supplies and equipment for embarkation and performs various Force Deployment Planning and Execution (FDP&E) functions to support the movement of personnel, supplies, and equipment via all modes of transportation using commercial and military assets, at all levels including unit, MAGTF, and joint operations.  They are trained in the application of Automated Information Systems (AIS) that are utilized throughout the Defense Transportation System (DTS) to account, track, and interface movement data with load planning programs and joint AIS to support the FDP&E process and In Transit Visibility (ITV).  The Logistics/ Embarkation Specialist is trained to prepare aircraft and ship load plans that meet organizational requirements.  They assist with the preparation, planning, and execution of strategic mobility plans in accordance with the Time Phased Force Deployment Data (TPFDD) used to deploy and sustain forward deployed forces.  The Logistics/ Embarkation Specialist also performs multiple logistics administrative duties within the J/G/S-4 section.  They compile and maintain logistics support data, compute combat logistics support requirements, and coordinate combat logistics functions in support of MAGTF operations and deployments.  At the SNCO level, they will also serve as Combat Cargo Assistants (CCAs) onboard naval amphibious assault ships.  MOS 0491, Logistics/Mobility Chief is assigned as the primary MOS upon promotion to Gunnery Sergeant.\n",
    "moc_key": "0431",
    "moc_code": "0431",
    "moc_title": "Logistics/Embarkation Specialist",
    "moc_full_title": "0431 - Logistics/Embarkation Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13495",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Logistics Specialist prepares supplies and equipment for embarkation and performs various Force Deployment Planning and Execution (FDP&E) functions and duties to support the movement of personnel, supplies, and equipment via all modes of transportation using commercial and military assets, at all levels including unit, MAGTF, and joint operations. Additionally, they perform various duties that support the establishment, maintenance and control of transportation throughput systems on beaches, landing zones, ports (air and sea), and terminals (rail, truck, and container) used in support of MAGTF operations and deployments. They are trained in landing force support party, conducting port arrival/departure airfield, helicopter support team operations, and rail head operations. The Logistics Specialist is also trained in the application of automated information systems (AIS) that are utilized throughout the defense transportation system (DTS) to account, track, and interface movement data with load planning programs and joint AIS to support the FDP&E process and In Transit Visibility (ITV) of these operations. The Logistics Specialist is trained to prepare aircraft and ship load plans that meet organizational requirements. They assist with the preparation, planning, and execution of strategic mobility plans in accordance with the Time Phased Force Deployment Data (TPFDD) used to deploy and sustain forward deployed forces. The Logistics Specialist also performs multiple logistics administrative duties within the J/G/S-4 section. They compile and maintain logistics support data, compute combat logistics support requirements, and coordinate combat logistics functions in support of MAGTF operations and deployments. At the SNCO level, they will also serve as Combat Cargo Assistants (CCAs) onboard naval amphibious assault ships. MOS 0491, Logistics/Mobility Chief is assigned as the primary MOS upon completion of the Logistics Chiefs Course at the staff sergeant or gunnery sergeant rank.\n",
    "moc_key": "0441",
    "moc_code": "0441",
    "moc_title": "Logistics Specialist",
    "moc_full_title": "0441 - Logistics Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6323",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Airborne and Air Delivery Specialists are responsible for the maintenance of all life support equipment relating to Airborne/Airdrop Operations.  In addition, they will assist in preparing supplies and equipment necessary to deliver personnel and/or equipment via parachute, external sling load, and air mobility operations.  They are responsible for performing parachute repack as well as conducting preventive and corrective maintenance on all airdrop equipment, and will assist in evaluating proposed Landing Zone/Drop Zones in order to support the planning and execution of effective personnel, supplies, and equipment clearance during airborne, airdrop and equipment recovery operations.  They will also perform various supervisory duties in support of airborne and airdrop missions to include, but to limited to, mission planning, Jumpmaster (military freefall and static line), Drop Zone Safety Officer, Malfunctions Officer, Sling Load Inspector, and Airdrop Load Inspector Certification.\n",
    "moc_key": "0451",
    "moc_code": "0451",
    "moc_title": "Airborne and Air Delivery Specialist",
    "moc_full_title": "0451 - Airborne and Air Delivery Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6324",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Personnel Retrieval and Processing Specialist perform duties in both combat and non-combat environments pertaining to the search and recovery, processing, tentative identification, interment, disinterment, and transportation of human remains and personal effects.  Furthermore, they perform the various duties pertaining to the establishment of collection points and interments sites.  These duties are performed in both joint and single service theaters of operations and in an NBCR environment.\n",
    "moc_key": "0471",
    "moc_code": "0471",
    "moc_title": "Personnel Retrieval and Processing Specialist",
    "moc_full_title": "0471 - Personnel Retrieval and Processing Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6325",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Landing Support Specialist performs various duties that support the establishment, maintenance and control of transportation throughput systems on beaches, landing zones, ports (air and sea), and terminals (rail, truck, and container) used in support of MAGTF operations and deployments.  They are trained in the doctrinal concepts of landing support and the landing force support party; conducting port, arrival/departure airfield, helicopter support team operations, and rail head operations.  The Landing Support Specialist is also trained in the application of automated information systems (AIS) that are utilized throughout the defense transportation system (DTS) to track, and interface movement data with load planning programs and joint AIS to support the FDP&E process and in-transit visibility (ITV).  NCOs and Staff NCOs plan, conduct, and supervise landing support operations and training.  At the MAGTF level, they assist with the throughput of unit personnel, supplies and equipment.  They also assist with the preparation, planning, and execution of strategic mobility plans in accordance with the time phased force deployment data (TPFDD) used to deploy and sustain forward deployed forces.  At the SNCO level, they will also serve as Combat Cargo Assistants (CCAs) onboard naval amphibious assault ships.  MOS 0491, Logistics/Mobility Chief is assigned as the primary MOS upon promotion to Gunnery Sergeant.\n",
    "moc_key": "0481",
    "moc_code": "0481",
    "moc_title": "Landing Support Specialist",
    "moc_full_title": "0481 - Landing Support Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6326",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Logistics/Mobility Chief coordinates, plans, conducts and supervises logistics, embarkation, and landing support operations throughout the Marine Corps.  They are also responsible for unit level logistics and embarkation training.  They coordinate all combat logistics functions to deploy and sustain Marine combat forces of a MAGTF and its attached units.  Logistics/Mobility Chiefs also serve as Combat Cargo Assistants (CCAs) onboard naval amphibious staffs and ships.  They serve on General Officer Staffs at the MEF, MARFOR, and HQMC level and conduct planning and execution of MAGTF deployments at the strategic level.  Logistics/Mobility Chiefs articulate command strategic mobility requirements both present and future to appropriate agencies, such as; Headquarters Marine Corps, U.S. Transportation Command and the three subordinate Transportation Component Commands (TCCs); Surface Deployment Distribution Command, Military Sealift Command, and Air Mobility Command.  As the Logistics/Mobility Chiefs' career progresses, they are assigned to Naval and Joint Staffs as a liaison for the Marine Corps where they provide interface and address Marine Corps' mobility and lift requirements.  They can also be assigned to serve with the TCCs as liaisons to convey the MAGTF commander's operational requirements to support unit moves at the operational/strategic level.\n",
    "moc_key": "0491",
    "moc_code": "0491",
    "moc_title": "Logistics/ Mobility Chief",
    "moc_full_title": "0491 - Logistics/ Mobility Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6327",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Enlisted MAGTF Planning Specialist is responsible for functional support in the areas of Force Deployment Planning & Execution (FDP&E), Joint Combat Capability Assessment (JCCA), and Global Force Management (GFM).  Typical duties include updating plan via established GFM/ FDP&E automated data processing tools and coordinating execution of force deployment plans.\n",
    "moc_key": "0511",
    "moc_code": "0511",
    "moc_title": "Marine Air Ground Task Force (MAGTF) Planning Specialist",
    "moc_full_title": "0511 - Marine Air Ground Task Force (MAGTF) Planning Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6335",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Transmissions System Operators employ transmissions systems to enable command and control.  Typical duties include the operation and maintenance of the Very Small Aperture Terminal-Expeditionary (VSAT-E), High Frequency (HF), Very High Frequency (VHF), Super High Frequency (SHF) and Ultra High Frequency (UHF) vehicular or man pack radio sets, including antennas and power sources, establishing contact with distant stations, processing and logging of messages, conducting frequency changes or cryptographic codes and maintaining equipment at the first echelon.  Additional skills include planning, coordinating, executing operations while utilizing program of record equipment and field-expedient antennas to integrate communication networks.  Operators will be familiar with spectrum analyzing tools, specialized computer hardware/software programs, transmission security (TRANSEC), and communications security (COMSEC).  Skill progression training for Staff Sergeant through Corporal is the Transmissions Supervisor Course located at Camp Pendleton (M10BNPB), Camp Lejeune (M03BNPG), and Okinawa (M22BNP4) at the Regional Communications Training Centers.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0621",
    "moc_code": "0621",
    "moc_title": "Transmissions System Operator",
    "moc_full_title": "0621 - Transmissions System Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7623",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Satellite Transmissions System Operators install, operate and maintain various wideband satellite communication terminals operating in the AEHF, KU, KA, X, and L bands.  Marines will be trained to operate complex satellite systems to integrate communication networks and enable command and control.  Operators will be familiar with spectrum analyzing tools, specialized computer hardware/software programs, transmission security (TRANSEC), and communications security (COMSEC).  Skill progression training for Staff Sergeant through Corporal is the Transmissions Supervisor Course located at Camp Pendleton (M10BNPB), Camp Lejeune (M03BNPG), and  Okinawa (M22BNP4) at the Regional Communications Training Centers.\n",
    "moc_key": "0627",
    "moc_code": "0627",
    "moc_title": "Satellite Transmissions System Operator",
    "moc_full_title": "0627 - Satellite Transmissions System Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6339",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Transmissions Chiefs plan, manage installation, operate, maintain, and supervise advanced transmissions operations; develop site plans for line of site (LOS), troposcatter and satellite communications systems, coordinates the development of the communications electronic operating instruction (CEOI).  The Transmissions Chief is responsible for training, security measures, employment of transmission equipment, systems integration with networks for all elements of transmission, data communications, and wireless architecture and cybersecurity.  Additionally, Transmissions Chiefs must be thoroughly familiar with frequency management (planning for and managing frequency requirements, request process, time lines, and use of allocated spectrum) spectrum requirements, programming and planning tools, maintenance procedures budgeting, and administration processes.\n",
    "moc_key": "0629",
    "moc_code": "0629",
    "moc_title": "Transmissions Chief",
    "moc_full_title": "0629 - Transmissions Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7611",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Network Administrators install operate and maintain local area networks (LAN) and wide area networks (WAN) to enable command and control.  Typical duties include routing/switching configuration, cybersecurity, premise wiring, installation of network components.  They establish technical control sites, conduct fault analysis, circuit testing and end to end troubleshooting.  Additional responsibilities include, network monitoring and quality of service (QOS) to maintain adequate bandwidth utilization in of communication networks and data services.  Network Administrators will maintain records on activation/ deactivation of communications links and maintenance actions performed.  Marines will be familiar with routing protocols, virtual private networks (VPN), internet protocol security (IPSEC), subnetting, traffic monitoring and cybersecurity.  Skill progression training for Staff Sergeant through Corporal is the Network Supervisor Course located at Camp Pendleton (M10BNPB), Camp Lejeune (M03BNPG), and Okinawa (M22BNP4) at the Regional Communications Training Centers.  Marines in this MOS may be assigned to a BIC within their occupational field that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0631",
    "moc_code": "0631",
    "moc_title": "Network Administrator",
    "moc_full_title": "0631 - Network Administrator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7612",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Network Chiefs install, operate, maintain, and supervise local area networks (LAN) and wide area networks (WAN) to enable command and control. The Network Chief is responsible for training, advanced routing/switching, cybersecurity, locating and correcting faults, quality of service (QOS), implementation/management of the cable plan, long haul transport, internet (IP) management, encryption management, network monitoring, end to end systems integration and troubleshooting. Additionally, Network Chiefs must be thoroughly familiar with security, programming and planning tools, maintenance procedures, budgeting, and administration processes. Network Chiefs also supervise the establishment of the technical control sites. Marines in this MOS may be assigned to a BIC within their occupational field that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0639",
    "moc_code": "0639",
    "moc_title": "Network Chief",
    "moc_full_title": "0639 - Network Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7613",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Data Systems Administrators support a myriad of computer and Network Operating Systems (NOS) to include versions of Linux, Microsoft, and Unix, to enable command and control. Typical duties include active directory administration, Domain Name Service (DNS) Public Key Infrastructure (PKI), Warfighting Systems, cybersecurity, Database administration and Unified Communications. Marines will be familiar with command line interface and tools (CLI), performance monitoring, client/server configuration, voice and video services, storage administration, virtualization, collaborative tools, and troubleshooting of hardware/software. Skill progression training for Staff Sergeant through Corporal is the Data Systems Supervisor Course.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0671",
    "moc_code": "0671",
    "moc_title": "Data Systems Administrator",
    "moc_full_title": "0671 - Data Systems Administrator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7614",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Data Systems Chiefs supports a myriad of technologies to include data systems, virtualization, unified communications and application development to enable command and control. The Data Systems Chief is responsible for training, domain infrastructure, active directory management, cloud services, disaster recovery, cybersecurity, database management, scripting, hardware/software management, Storage Area Network (SAN), Network Attached Storage (NAS), virtualization and messaging. Additionally, Data Systems Chiefs must be thoroughly familiar with security, programming and planning tools, maintenance procedures, budgeting, and administration processes.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0679",
    "moc_code": "0679",
    "moc_title": "Data Systems Chief",
    "moc_full_title": "0679 - Data Systems Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6345",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Information Security Technitions (ISTs) serve as the Marine Corpsâ€™ primary functional proponent for the Department of the Navy's (DON) communications security (COMSEC) and cryptographic key management. These marines provide day-to-day operation of the DON's COMSEC material control system. Their duties include; coordination for the provisioning of symmetric and asymmetric key products to support command, control, communications, and computers (C4) systems in collaboration with communications planners for the development of communications instructions; providing information regarding new or revised COMSEC policies and procedures and their impact on the command. They train and inspect COMSEC users within the command. monitor and maintain the command COMSEC material allowances, and perform spot checks of users to assess adherence to prescribed instructions. Billet specific applications may serve as a central office of record (COR) auditor for COMSEC account inspections.\n",
    "moc_key": "0681",
    "moc_code": "0681",
    "moc_title": "Information Security Technician",
    "moc_full_title": "0681 - Information Security Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6347",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Communications Chief must possess thorough understanding of equipment capabilities and system integration for all elements of transmissions, networks, data systems, cybersecurity, information, and communications security management.  They are trained to evaluate technical supportability and limitations of communications equipment, draft systems architecture, communications plans, and coordinate technical interface and restoration issues with higher, adjacent, and subordinate commands.  Additionally, they are responsible for manpower management, training, equipment accountability, and operational readiness.  The Communications Chief can serve as the Senior Enlisted Advisor (SEA) to the Director of Command, Control, Communications and Computers (C4), Headquarters Marine Corps and at the Marine Corps Cyberspace Operations Group (MCCOG), occupational field specialist on the staff of HQMC C4, and as Communications Chiefs for communication training battalion, at the MARFOR level, and in all levels of the Marine Air-Ground Task Force (MAGTF).  The duties of the Communications Chief encompass providing assistance and advice to MAGTF Commanders AC/S G-6, Commanders of Communication Battalions, and other designated commands concerning plans, policies, procedures and emerging communications requirements and capabilities led by HQMC C4 and other proponents and advocates.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "0699",
    "moc_code": "0699",
    "moc_title": "Communications Chief",
    "moc_full_title": "0699 - Communications Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6348",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "As a member of a Field Artillery Howitzer Battery, Cannoneers prepare artillery pieces and equipment for movement, combat, and firing.  They inspect and prepare ammunition for firing, and perform the various jobs incident to firing such as, laying for elevation and deflection, loading the piece, and handling ammunition.  Field Artillery Cannoneers perform preventive maintenance and clean artillery pieces and equipment.  They make routine tests and authorize repairs to equipment.  Camouflage position, protect equipment from chemical warfare agents, and construct field fortifications.\n",
    "moc_key": "0811",
    "moc_code": "0811",
    "moc_title": "Field Artillery Cannoneer",
    "moc_full_title": "0811 - Field Artillery Cannoneer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6350",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Field Artillery Radar Operators perform the duties required to emplace, operate, and displace counterfire radar systems.  Other duties include operating military vehicles, generator assets, communications equipment, establishing radio networks for voice and digital communications, and performing hasty survey techniques.  Radar Operators also work in the artillery target processing centers.  These duties include operating fire support systems that process counterfire/artillery target intelligence and manage radar assets in the field.\n",
    "moc_key": "0842",
    "moc_code": "0842",
    "moc_title": "Field Artillery Radar Operator",
    "moc_full_title": "0842 - Field Artillery Radar Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6351",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Field Artillery Fire Control Marine perform duties essential to the delivery of accurate artillery fire.  Typical duties include preparation of fire control equipment for movement and operation, performance of preventive maintenance, routine testing, authorized minor repairs and fire control equipment, and operation of field communications equipment.  Fire control computation includes the use of computer equipment systems, plotting survey data on firing charts, determination of target coordinates, and the conversion to target coordinates and observer's reports into firing data and commands.  MOS 0844 is assigned upon completion of formal school.  Upon promotion to Staff Sergeant and the appropriate formal school, the 0844 will be designated MOS 0848.\n",
    "moc_key": "0844",
    "moc_code": "0844",
    "moc_title": "Field Artillery Fire Control Marine",
    "moc_full_title": "0844 - Field Artillery Fire Control Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6352",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Field Artillery Sensor Support Marines assist in the delivery of accurate artillery fires and prosecution of counter fire fight by developing weather data for artillery ballistic computations, performing survey operation.  Duties include preparing and operating weather observation equipment such as theodolites and surface sensors, measuring atmospheric readings; preparing and operating survey equipment such as inertial navigation systems, global positioning system receivers, theodolites and electronic distance measuring equipment.  Additionally, the 0847 will prepare and operate acoustic sensors for employment.  Other duties include operating computer systems for computations, digital communications, command and control, and imagery development.  MOS 0847 is assigned upon completion of formal school.  Upon promotion to Staff Sergeant and the appropriate formal school, the 0847 will be designated MOS 0848.\n",
    "moc_key": "0847",
    "moc_code": "0847",
    "moc_title": "Field Artillery Sensor Support Marine",
    "moc_full_title": "0847 - Field Artillery Sensor Support Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6353",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Field Artillery Operations Chief perform the various duties associated with the operation of a field artillery and mortar fire direction center; operations or training section; artillery sensor section; survey section.  Duties include preparing personnel and equipment for movement and operation; assisting in location of fire direction center in the field; maintaining a situation map, operations journal, and survey records; performing duties incident to the preparation, reproduction, and distribution of operations orders, training orders, memoranda, schedules, status reports, and S-3 periodic reports; preparing operations maps and overlays; assisting in the establishment and operation of artillery meteorological stations, direct atmospheric meteorological observation interpreting, evaluating and distributing atmospheric data; performing duties incident to execution of sensor plans essential to proper employment of field artillery; assisting in installation, orientation, operation, and maintaining target acquisition radar equipment; and training personnel in radar, meteorological, survey, acoustic, and fire direction procedures.\n",
    "moc_key": "0848",
    "moc_code": "0848",
    "moc_title": "Field Artillery Operations Chief",
    "moc_full_title": "0848 - Field Artillery Operations Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6354",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Fire Support Marines perform duties related to the planning, observation, conduct, and control of surface to surface and air to surface fires. These duties include planning, calling for, integrating, coordinating, observing and adjusting artillery (cannon, rocket, missile) and naval surface fire support (NSFS), employment of LASER designators, range finders, and LASER guided munitions and coordination of non-lethal fires. These duties also include operating communications equipment, establishing radio networks for voice and digital communications, as well as operating Marine Corps fire support systems. Upon promotion to staff sergeant and completion of the appropriate formal schools, the 0861 will be designated MOS 0871.\n",
    "moc_key": "0861",
    "moc_code": "0861",
    "moc_title": "Fire Support Marine",
    "moc_full_title": "0861 - Fire Support Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "9705",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Artillery Senior Cannoneer is responsible to the commander and assists in the planning, training, deployment and employment of all organic weapons systems and the units combat power capabilities.  They supervise and coordinate the preparation and assignment of personnel/equipment in accordance with the table of organization/table of equipment. Gunnery sergeants serve as the battery gunnery sergeant/ammunition platoon sergeant (HIMARS). Master sergeants serve as battery (HIMARS) and battalion field artillery chiefs. Master gunnery sergeants serve as battalion (HIMARS) and regimental field artillery chiefs.\n",
    "moc_key": "0869",
    "moc_code": "0869",
    "moc_title": "Artillery Unit Leader",
    "moc_full_title": "0869 - Artillery Unit Leader",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13511",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Fires and Effects Integrator serves as the senior enlisted tactical advisor to the commander and staff for all lethal and non-lethal fire support assets to include mortars, artillery (cannon, rocket, missile), NSFS, and provide terminal attack control of fixed and rotary wing aircraft in support of close air support (CAS).  These duties include planning, integrating, coordinating, observing Surface to surface fires, employment of LASER designators, range finders. These duties also include operating communications equipment, establishing radio networks for voice and digital communications, as well as operating Marine Corps fire support systems.\n",
    "moc_key": "0871",
    "moc_code": "0871",
    "moc_title": "Joint Fires and Effects Integrator",
    "moc_full_title": "0871 - Joint Fires and Effects Integrator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6363",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Using knowledge of electrical theory and concepts, electricians install, operate, maintain, and repair underground, above ground, and tactical electrical power distribution systems.  Additionally, electricians perform preventive maintenance checks and service and operate electrical power generation and power distribution equipment, load banks, and floodlight sets.  Electricians also install and repair interior wiring.  Corporals through Staff Sergeants are afforded the opportunity to attend a skill progression course.  The Advanced Electrician Course provides in-depth instruction on code requirements and planning electrical support to include determining demand, phase balancing, and voltage drops.  An apprenticeship program, leading to U.S. Department of Labor certification as a Journeyman Electrician, is available to electricians under the United Services Military Apprenticeship Program (USMAP).\n",
    "moc_key": "1141",
    "moc_code": "1141",
    "moc_title": "Electrician",
    "moc_full_title": "1141 - Electrician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13897",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "By applying electrical theory, electronic fundamentals, and refrigeration concepts, Utilities Systems Technicians perform organizational and intermediate repairs on electric motors, electronic modules, motor control circuits, electric power generation equipment, field refrigeration equipment, environmental control units, and electrical systems repairs of engineer equipment (to include ground equipment). Additionally, they install and operate field refrigeration units and environmental control units and thus must be certified by the Environmental Protection Agency (EPA) to handle and recover Hydro Chlorofluorocarbons (HCFCs) and Chlorofluorocarbons (CFC). An apprenticeship program, leading to U.S. Department of Labor certification as a journeyman worker, is available under the United Services Military Apprenticeship Program (US MAP). For a complete listing of duties and tasks, refer to the Marine Corps Engineer and Utilities Training and Readiness Manual.\n",
    "moc_key": "1164",
    "moc_code": "1164",
    "moc_title": "Utilities Systems Technician",
    "moc_full_title": "1164 - Utilities Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6366",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Utilities Chief is responsible to the commander and assists in the planning, training, deployment and employment of all utilities capabilities.  They supervise and coordinate the assignment of personnel and equipment in accordance with the Table of Organization and Equipment.  They plan, supervise, and coordinate the installation, operation, and maintenance of utilities assets.  This MOS is technical in nature and requires years of experience to become proficient.  Due to the diversity of commands throughout the Marine Corps, some of the duties and tasks performed by the Utilities Chief may overlap with those of the Engineer Equipment Chief, Motor Transport Maintenance Chief, and Motor Transport Operations Chief.  They may also be assigned to the staff of a Marine Air-Ground Task Force command element, ground combat element, air combat element, and logistics combat element advising utilities support.  Additional duties may include formal schools faculty, new equipment/systems research and development, and new systems acquisition.  This MOS will only be assigned to graduates of the resident Utilities Chief Course.\n",
    "moc_key": "1169",
    "moc_code": "1169",
    "moc_title": "Utilities Chief",
    "moc_full_title": "1169 - Utilities Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6367",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Water Support Technicians install, operate, inspect, and perform preventive and corrective maintenance on pumps, water purification equipment, water storage/distribution systems, and laundry and shower facilities.  They conduct and evaluate water surveys, water reconnaissance, and water quality analysis as well as establish and maintain water disposal systems.  These technicians also plan, install, and repair the plumbing systems of structures.  Corporals through Staff Sergeants are afforded the opportunity to attend a skill progression course.  The Advanced Water Support Technician course (M03UAC2) provides in-depth instruction on code requirements, water reconnaissance, planning water support, designing plumbing systems, and diagnosing electrical malfunctions on water support equipment.  An apprenticeship program, leading to U.S. Department of Labor certification as a Journeyman, is available to Water Support Technicians under the United Services Military Apprenticeship Program (USMAP).\n",
    "moc_key": "1171",
    "moc_code": "1171",
    "moc_title": "Water Support Technician",
    "moc_full_title": "1171 - Water Support Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6368",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Metal Workers examine drawings and work orders; determine sequence of operations, materials, tools, equipment, time, and personnel required.  Duties include selection of proper stock, and set up of work on welding equipment to include the automated Water Jet cutting system.  The control of quality and accuracy is met by the welder's use of Non-destructive inspection techniques that include liquid penetrant testing and magnetic particle testing.  They also perform installation, operation, maintenance and repair of metalworking, and welding equipment and material.\n",
    "moc_key": "1316",
    "moc_code": "1316",
    "moc_title": "Metal Worker",
    "moc_full_title": "1316 - Metal Worker",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6369",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Engineer Equipment Mechanics perform preventive maintenance and perform repairs to diesel engines and gasoline and diesel driven construction equipment such as material handling equipment, earth moving equipment, construction equipment and other engine driven or towed equipment.\n",
    "moc_key": "1341",
    "moc_code": "1341",
    "moc_title": "Engineer Equipment Mechanic",
    "moc_full_title": "1341 - Engineer Equipment Mechanic",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6371",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Engineer Equipment Operators operate gasoline or diesel engine equipment used in material handling and earthmoving operations, to include all equipment accessories.\n",
    "moc_key": "1345",
    "moc_code": "1345",
    "moc_title": "Engineer Equipment Operator",
    "moc_full_title": "1345 - Engineer Equipment Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6372",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Engineer Equipment Chiefs coordinate and manage the maintenance and employment of engineer equipment in both horizontal construction and material handling operations. They manage equipment licensing, certification of tactical ground load lifting equipment, equipment repairs, and related metal working in support of mobility, counter-mobility, general, combat engineering, and logistics operations in any environment. Additionally, they manage and coordinate ground maintenance, maintenance management policy, programs, procedures, functions, maintenance automated information systems (MAIS) requirements, and the support of engineer equipment and watercraft.\n",
    "moc_key": "1349",
    "moc_code": "1349",
    "moc_title": "Engineer Equipment Chief",
    "moc_full_title": "1349 - Engineer Equipment Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6373",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Engineer Assistants perform various duties incidental to construction design, planning, estimating, and management.  Personnel assigned this MOS are trained to use optical reading/electronic total station survey instruments to establish the horizontal and vertical alignment/layout for construction projects.  In addition, they are trained to use manual/ Computer Aided Drafting (CAD) methods of preparing architectural/mechanical/ civil drawings, to include computations for bills of material/earthwork volumes.\n",
    "moc_key": "1361",
    "moc_code": "1361",
    "moc_title": "Engineer Assistant",
    "moc_full_title": "1361 - Engineer Assistant",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6374",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Combat Engineers conduct engineer reconnaissance; emplace obstacle systems; conduct breaching operations; reduce explosive obstacles/hazards conduct mine/countermine operations; employ demolitions and military explosives; conduct urban breaching; conduct route and area clearance; non-standard bridging/repair; construct and maintain combat roads and trails; construct expedient roads and airfield/landing zones; design and construct survivability positions; perform expedient vertical and horizontal construction; design, construct and maintain base camps/forward operating bases and combat outposts; and fight as provisional infantry.\n",
    "moc_key": "1371",
    "moc_code": "1371",
    "moc_title": "Combat Engineer",
    "moc_full_title": "1371 - Combat Engineer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6376",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Expeditionary Fuels Technicians install, operate and employ a family of tactical fuel systems (TFS) and accessory equipment, tailoring fuel equipment in modular sets to address mission needs in support of both ground and aviation operations. This includes the setup and operation of fuel systems in support to installations, forward operating bases (FOBs) a forward arming and refueling points (FARPS). While utilizing tactical fuel systems, expeditionary fuel technicians can receive, store and dispense various petroleum products in support of tactical operations. Additionally, expeditionary fuels technicians are responsible for overseeing the quality surveillance procedures of fuel dispensed from TFS, provide support for the calculation of fuel estimates in support of operations and assist in the coordination of sources of class III to support expeditionary operations.\n",
    "moc_key": "1391",
    "moc_code": "1391",
    "moc_title": "Expeditionary Fuels Technician",
    "moc_full_title": "1391 - Expeditionary Fuels Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7741",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Cyberspace Warfare Operator is familiar with all aspects of cyberspace maneuver operations.  They employ offensive and defensive cyber tools, tactics, techniques, and procedures.  They integrate effects into warfighting functions in order to achieve tactical, operational, and strategic objectives.  The Cyber Warfare Operator further provides the means to emulate tactics, techniques, and procedures used by known adversaries to identify unmitigated vulnerabilities through simulated exploitation or attacks on Department of Defense information systems.  Familiar with digital network concepts and analytical techniques that support tactical cyber operations.  Utilizing these skills to enumerate friendly environments, these operators search for and respond to targeted adversary presence within friendly terrain. Marines in this MOS may be assigned to a BIC within their occupational field that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "1721",
    "moc_code": "1721",
    "moc_title": "Cyberspace Warfare Operator",
    "moc_full_title": "1721 - Cyberspace Warfare Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13496",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Civil Affairs (CA) Specialists perform various duties in both combat and non-combat environments involving the integration, planning, and conduct of civil affairs operations (CAO) and civil-military operations (CMO) in support of marine air-ground task force (MAGTF) operations. CA Specialists inform, influence, shape and gain access to the cognitive civil environment through targeted and integrated civil reconnaissance and civil engagements. This PMOS is only applicable to the reserve component. The MOS was previously listed as 0532.\n",
    "moc_key": "1732",
    "moc_code": "1732",
    "moc_title": "Civil Affairs Specialist",
    "moc_full_title": "1732 - Civil Affairs Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13509",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Influence Specialists are the Marines that make up the PSYOP and civil affairs forces in the active component. These are the forces which conduct military information support operations (MISO), civil affairs operations (CAO), or civil military operations (CMO). The Influence Specialistâ€™s billet will determine their support to plan and execute functions pertaining to military information support operations (MISO), civil authoritiesâ€™ information support (CAIS), and civil affairs operations (CAO). Influence Specialists deploy in small teams known as tactical PSYOP teams or CA teams, depending on the billet they are filling, to employ capabilities that operationalize the information warfighting function and harness the military applications of information in all military operations. Influence Specialists capabilities are critical to the success of the fleet marine force (FMF) mission, as they enable commanders to shape the information and security environment in their areas of responsibility (AOR).\n",
    "moc_key": "1751",
    "moc_code": "1751",
    "moc_title": "Influence Specialist",
    "moc_full_title": "1751 - Influence Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13510",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Influence Chief is the senior staff non-commissioned officer that directly assists Influence Officers, Civil-Military Operations Planners, and mentors and advises Influence Specialists. They manage the conduct of influence operations and can facilitate the integration of influences operations with other information activities and force maneuver in the information environment. The Influence Chief assists in the planning, training, deployment, and implementation of capabilities and resources required to conduct influence operations. Influence Chiefs possess knowledge on the joint operational and marine corps planning processes (JOPP/MCPP) in order to develop integrated influence plans and operations.\n",
    "moc_key": "1795",
    "moc_code": "1795",
    "moc_title": "Influence Chief",
    "moc_full_title": "1795 - Influence Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7742",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Cyberspace Warfare Chief is the senior staff non-commissioned officer who directly assists Cyberspace Warfare Officers and Cyberspace Weapons Officers and supports all Cyber Warfare Operators.  They manage the conduct of cyber warfare and possess an understanding of cyberspace warfare operations. The Cyberspace Warfare Chief assists in the planning, training, deployment, and implementation of capabilities and resources required to conduct cyber operations. Cyberspace Warfare Chiefs possess in-depth knowledge of the Joint operational and Marine Corps planning processes (JOPP and MCPP) to develop integrated cyber warfare plans and operations. Marines in this MOS may be assigned to a BIC within their occupational field that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "1799",
    "moc_code": "1799",
    "moc_title": "Cyberspace Warfare Chief",
    "moc_full_title": "1799 - Cyberspace Warfare Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6378",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "An Assault Amphibian Crewmember performs various duties related to the operation and maintenance of Amphibious Vehicles (AV), to include tactical employment, gunnery using the onboard weapon systems, communications, and maneuver.  AA Crewmembers employ their vehicle in support of Infantry units during ship to objective maneuver and during subsequent operations ashore.  Typical duties may include preventive and corrective maintenance, and pre-combat checks and inspections on the AV and its associated equipment in order to support both amphibious and land operations.\n",
    "moc_key": "1833",
    "moc_code": "1833",
    "moc_title": "Assault Amphibious Vehicle (AAV) Crewmember",
    "moc_full_title": "1833 - Assault Amphibious Vehicle (AAV) Crewmember",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6379",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Amphibious Combat Vehicle Crewmember performs various duties incident to the operation and maintenance of the vehicle, to include tactical employment, precision gunnery using on board vehicle weapon systems, and maneuver.¿¿ACV Crewmembers employ their vehicle during shore to shore, ship to objective maneuver, and during subsequent operations ashore.¿¿Typical duties may include preparing the ACV and associated equipment for movement and combat, locating, and engaging targets, driving the ACV in the water and ashore, and performance of preventive and corrective maintenance.\n",
    "moc_key": "1834",
    "moc_code": "1834",
    "moc_title": "Amphibious Combat Vehicle (ACV) Crewmember",
    "moc_full_title": "1834 - Amphibious Combat Vehicle (ACV) Crewmember",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6380",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Small Arms Repairer/Technician in the grade of Private through Lance Corporal, under supervision, inspect, maintain, and repair small arm weapon systems, less permanently mounted vehicular weapons.  The Small Arms Repairer/Technician also completes basic shop administrative actions utilizing forms, records, technical manuals, directives, and automated information systems.  At the ranks of Corporal through Gunnery Sergeant, the Small Arms Repairer/Technician performs maintenance actions, trains subordinates, and supervises the inspection, maintenance, and repair of all small arms, less permanently mounted vehicular weapons.  The Small Arms Repairer/Technician also performs, maintains, and supervises shop maintenance management programs and coordinates the maintenance and repair of small arms according to grade.\n",
    "moc_key": "2111",
    "moc_code": "2111",
    "moc_title": "Small Arms Repairer/Technician",
    "moc_full_title": "2111 - Small Arms Repairer/Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6382",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Artillery Systems Technician, under supervision, performs basic duties incident to inspection, maintenance, and repair of Towed Artillery Howitzers.  The Artillery Systems Technician also completes basic shop administrative forms and records utilizing technical manuals.  At the Gunnery Sergeant through Corporal level, the Artillery Systems Technician performs, trains, and supervises various duties incident to inspection, maintenance and repair of towed artillery howitzers.  The Artillery Systems Technician also prepares, maintains and supervises a shop maintenance and management program, and performs the maintenance and repair of Towed Artillery Howitzers according to grade.\n",
    "moc_key": "2131",
    "moc_code": "2131",
    "moc_title": "Artillery Systems Technician",
    "moc_full_title": "2131 - Artillery Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6383",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The AAV/ACV Repairer/Technician performs basic automotive duties including the inspection, maintenance, and repair of the AAV/ACV family of vehicles.  The AAV/ACV Repairer/Technician performs basic shop administrative actions utilizing technical manuals and automated information systems.  The AAV/ACV Repairer/Technician also operates the AAV/ACV recovery vehicle in support of combat and/or garrison operations. As a member of the recovery crew, the AAV/ACV Repairer/Technician will perform operator and field-level maintenance and maintain/manage associated tools and equipment, of which licensed to operate. Accordingly, they will employ land navigation techniques and must be knowledgeable with the operation of radios and weapon systems when mounted on the vehicle during tactical operations. The Gunnery Sergeant to Corporal level supervises, and performs various duties incident to the inspection, maintenance, and repair of the automotive and turret systems of the AAV.  In addition, AAV Repairer/Technicians prepare, maintain and supervise shop maintenance and management programs, and coordinate maintenance and recovery operations according to grade and position.\n",
    "moc_key": "2141",
    "moc_code": "2141",
    "moc_title": "Assault Amphibious Vehicle (AAV)/Assault Combat Vehicle (ACV) Repairer/Technician",
    "moc_full_title": "2141 - Assault Amphibious Vehicle (AAV)/Assault Combat Vehicle (ACV) Repairer/Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6385",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The LAV Repairer/Technician performs basic automotive duties including the inspection, maintenance, and repair of the LAV family of vehicles.  The LAV Repairer/Technician performs basic shop administrative actions utilizing technical manuals and automated information systems.  The LAV Repairer/Technician also operates the LAV recovery vehicle in support of combat and/or garrison operations. As a member of the recovery crew, the LAV Repairer/Technician will perform operator and field-level maintenance and maintain/manage associated tools and equipment, of which licensed to operate. Accordingly, they will employ land navigation techniques and must be knowledgeable with the operation of radios and weapon systems when mounted on the vehicle during tactical operations. At the grade of Corporal and above, the LAV Technician trains, supervises, and performs various duties related to the inspection, maintenance, and repair of automotive and turret systems of the LAV family of vehicles.  In addition, LAV Technicians prepare, maintain, and supervise shop maintenance and management programs, and coordinate maintenance and recovery operations according to grade and position.\n",
    "moc_key": "2147",
    "moc_code": "2147",
    "moc_title": "Light Armored Vehicle (LAV) Repairer/Technician",
    "moc_full_title": "2147 - Light Armored Vehicle (LAV) Repairer/Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6387",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ground Ordnance Vehicle Maintenance Chiefs supervise the maintenance, repair, and inspection of ground ordnance vehicles and support equipment.  Additionally, Ordnance Vehicle Maintenance Chiefs supervise and manage the administration of ordnance vehicle related maintenance programs and facilities. The Ordnance Vehicle Maintenance Chief is technically proficient in the following areas: organizational, maintenance, and resource management; specifically in the areas of: training, records and reporting via Major Automated Information Systems, preventive and corrective maintenance, equipment availability, publications control, supply support, and the oversight of command environmental and hazardous waste  programs. The Ground Ordnance Vehicle Maintenance Chief also serves as a Licensing Officer for Ground Ordnance Maintenance Vehicle Operators and supervises the recovery of ground ordnance vehicles. The Ground Ordnance Vehicle Maintenance Chief assists the Ground Ordnance Vehicle Maintenance Officer in execution of their duties.\n",
    "moc_key": "2149",
    "moc_code": "2149",
    "moc_title": "Ordnance Vehicle Maintenance Chief",
    "moc_full_title": "2149 - Ordnance Vehicle Maintenance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6388",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Machinists perform various duties incident to fabrication, repair or modification of engineer, motor transport, weapons, and accessories.  Duties include selection of proper stock and set up of work on lathes, shapes, milling machines, internal and external grinders, drill presses, saws and cylinder, or line-boring machines.  Machinists work from sketches, diagrams, blueprints, written specifications, or oral instructions.  The control of quality and accuracy is met by the machinists' use of precision measuring devices to include micrometers, vernier gauges, and various other gauges and the subsequent adjustment of machine tool controls.  Fabrication of metals is also followed by welding with all standard welding equipment.  Maintenance of all shop equipment is performed to ensure that serviceability is sustained.  Coordination with other repair shops, reporting of work completion, and the shop administrative functions are requirements to be effected by machinists.\n",
    "moc_key": "2161",
    "moc_code": "2161",
    "moc_title": "Machinist",
    "moc_full_title": "2161 - Machinist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6389",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Electro-Optical Ordnance Repairer performs electro-optical maintenance and repair to ground ordnance laser and night vision devices, small missiles systems, and other fire control equipment.  Duties also include performing mechanical, mechanical-optical and electrical repairs to include inspecting, troubleshooting and adjusting fire control instruments and systems.  The Electro-Optical Ordnance Repairer, grades Private through Corporal, also completes basic shop administrative forms and records using technical publications.  At the grades of Sergeant and above, the Electro-Optical Ordnance Repairer trains, supervises, and performs various duties and tasks incident to the management of an Electro-Optical Ordnance Repair shop or facility.\n",
    "moc_key": "2171",
    "moc_code": "2171",
    "moc_title": "Electro-Optical Ordnance Repairer",
    "moc_full_title": "2171 - Electro-Optical Ordnance Repairer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6390",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ground Ordnance Weapons Chief supervise the maintenance, repair, and inspection of all small arms weapons and towed artillery howitzers and direct the activities of assigned enlisted personnel in a small arms or towed artillery repair shop or facility.  They supervise and manage the administration of small arms or towed artillery maintenance facilities and offices.  The Ground Ordnance Weapons Chief is proficient in the organization, management, operation and conduct of technical inspections of small arms weapons, and towed artillery howitzers, all equipment, and maintenance shops or facilities for maintaining small arms or towed artillery howitzers.  The Ground Ordnance Weapons Chief assists the Weapons Repair Officer in all duties and tasks.  They manage command environmental and hazardous waste programs.  They supervise and provide oversight of disposal, storage, emergency planning for hazardous waste, and ozone depleting substances.  2181 Marines possess a comprehensive knowledge of environmental and hazardous waste programs, disposal, storage, emergency planning for hazardous waste, and ozone depleting substances. 2181 Marines possess a comprehensive understanding of maintenance procedures for small arms weapons, and towed artillery howitzers, repair shop management and operations, maintenance and supply procedures.\n",
    "moc_key": "2181",
    "moc_code": "2181",
    "moc_title": "Ground Ordnance Weapons Chief",
    "moc_full_title": "2181 - Ground Ordnance Weapons Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6391",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ammunition Technicians work in every facet of the ammunition field, including receipt, storage, issue, and handling of ammunition and toxic chemicals.\n",
    "moc_key": "2311",
    "moc_code": "2311",
    "moc_title": "Ammunition Technician",
    "moc_full_title": "2311 - Ammunition Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6392",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Explosive Ordnance Disposal (EOD) Technicians perform various duties may include locating, accessing, identifying, rendering safe, neutralizing, and disposing of hazards from foreign and domestic, chemical biological radiological nuclear and high-yield explosive (CBRNE), unexploded explosive ordnance (UXO), improvised explosive device (IED), and weapons of mass destruction (WMD) that present a threat to operations, installations, personal, or material.\n",
    "moc_key": "2336",
    "moc_code": "2336",
    "moc_title": "Explosive Ordnance Disposal (EOD) Technician",
    "moc_full_title": "2336 - Explosive Ordnance Disposal (EOD) Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6394",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Communications Intelligence (COMINT)/Electromagnetic Warfare (EW) Operators exploit every phase of communications signals and digital network systems by engaging in collection, processing, exploitation, dissemination, and analysis. Additional skills include planning, coordinating, and executing signals intelligence (SIGINT) and electromagnetic warfare (EW) operations from start to finish while utilizing both program of record equipment as well as commercially acquired equipment. Operators must perform communications electronic signals search missions, record intercepts of signals using electronic means, and measure, classify, and evaluate signals. Operators must be familiar with communications intercept receivers, specialized computer hardware and software programs, wideband converters used in the process of collecting, recording, analyzing, and reporting on a wide variety of intercepted communications signals. Operators will conduct and support full spectrum EW operations encompassing electromagnetic warfare support, electromagnetic attack, and the correct reporting thereof. Marines must be familiar with the conduct of SIGINT, EW, and cyber operations in support of the marine air ground task force (MAGTF) at both team and battalion levels and be prepared to contribute to each as deemed necessary by the unit commander.\n",
    "moc_key": "2621",
    "moc_code": "2621",
    "moc_title": "Communications Intelligence/Electromagnetic Warfare Operator",
    "moc_full_title": "2621 - Communications Intelligence/Electromagnetic Warfare Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7661",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "This is a PMOS that requires signals intelligence (SIGINT), electromagnetic warfare (EW), and support to cyberspace operations (CO) training focused on collection management, operational planning and coordination, analysis, reporting, exploitation, and dissemination in support of the seven warfighting functions. Duties encompass the supervision of tasking, collection, processing, exploitation, and dissemination of products related to the three disciplines of SIGINT: communications intelligence (COMINT), electronic intelligence (ELINT), and foreign instrumentation signals intelligence (FISINT). EW duties encompass the planning, coordination, and execution of full spectrum MAGTF EW operations including electromagnetic warfare support (ES), electromagnetic protect (EP), and electromagnetic attack (EA). Provides intelligence support to full spectrum CO defined as offensive cyberspace operations (OCO), defensive cyberspace operations (DCO), and DOD information network operations (DODIN). Technicians develop and maintain records on technical aspects of target emitters, develop and maintain communications order of battle files, situation maps, and other related SIGINT/EW/CO files. Technicians prepare and issue reports to include intelligence reports, technical reports, and summaries. Technicians are required to perform SIGINT/EW/CO briefings. This MOS is career progression for MOSs 2621, 2631, and 2641. MOS 2629 is assigned upon promotion to SSgt. Marines who are assigned an EMOS of 2712 through 2796 shall take the Defense Language Proficiency Test (DLPT) annually and shall maintain a minimum proficiency of L2/R2 on the Defense Language Proficiency Test (DLPT) in their assigned 27XX language(s), in accordance with reference (bb). Preferred target for assignment to career progression training is at the 5-8 years’ time in service (TIS) mark.\n",
    "moc_key": "2629",
    "moc_code": "2629",
    "moc_title": "Signals Intelligence/Electromagnetic Warfare Technician",
    "moc_full_title": "2629 - Signals Intelligence/Electromagnetic Warfare Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6396",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Analyst duties encompass all facets of Electronic Intelligence (ELINT); and electromagnetic warfare (EW) analysis including installation, operation, and preventive maintenance of associated equipment. Analysts perform signals analysis, prepare electronic order of battle appraisals, and map overlays. They operate signals intelligence (SIGINT) support equipment, to include systems setup, operations reporting, computer processing of tape recordings, issuing necessary EW reports, assisting in air crew training/ briefings, and performing routine preventive maintenance. Analysts are trained in the use of the integrated broadcast receiver/systems and analytic programs. Marines must be familiar with the conduct of SIGINT, EW, and cyber operations in support of the marine air ground task force (MAGTF) at both team and battalion levels and be prepared to contribute to each as deemed necessary by the unit commander.\n",
    "moc_key": "2631",
    "moc_code": "2631",
    "moc_title": "Electronic Intelligence/Electromagnetic Warfare Analyst",
    "moc_full_title": "2631 - Electronic Intelligence/Electromagnetic Warfare Analyst",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7660",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Cryptologic Language Analysts (CLA) monitor, transcribe, and translate intercepted target foreign communications; exploit every phase of designated foreign communications by engaging in collection, processing, exploitation, analysis, and reporting; and install, operate, and perform preventive maintenance of program of record as well as commercially acquired intercept equipment. Duties encompass all facets of signals intelligence (SIGNT), electronic warfare (EW) and cyber operations in support of the MAGTF at both team and battalion levels and must be prepared to contribute to each as deemed necessary by the unit commander. Marines shall periodically (annually or biennially, dependent on scores) retake the defense language proficiency test (DLPT) and shall maintain a minimum proficiency of Listening 2/Reading (L2/R2) DLPT in their assigned 27XX language(s), in accordance with reference (bb). Formal intermediate and advanced language training is available and will be afforded to CLAs no later than upon PCS from their first duty station. Per DoDI 3300.07, CLAs will engage, during normal duty hours, a minimum of 160 hours of formal language training every 24 months. MOS 2629, SIGINT/EW/CO Technician, is assigned upon promotion to staff sergeant. Marines shall maintain language proficiency in their assigned 27XX language(s) upon assignment of MOS 2629.\n",
    "moc_key": "2641",
    "moc_code": "2641",
    "moc_title": "Cryptologic Language Analyst",
    "moc_full_title": "2641 - Cryptologic Language Analyst",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6397",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "ISR Systems Engineers design and implement the integration and management of ISR platforms, intelligence datasets, and intelligence networks as members of the signals intelligence and all-source intelligence production chains. These duties include but are not limited to sensor integration, ensuring dataflow between intelligence systems, Sensitive Compartmented Information communications, maintain data standardization, enterprise support and services, network and data redundancy, and disaster recovery. Marines assigned this MOS receive training in computer hardware fundamentals, operating systems, information assurance, database and data flow management, radio frequency theory, satellite communications, networking, system integration, network and data science philosophies. This MOS will be assigned and voided only by the authority of the CMC (MM). Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2651",
    "moc_code": "2651",
    "moc_title": "Intelligence Surveillance Reconnaissance (ISR) Systems Engineer",
    "moc_full_title": "2651 - Intelligence Surveillance Reconnaissance (ISR) Systems Engineer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "8746",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Intelligence Technology and Data Chief is an intelligence systems technologist that is responsible for the design and implementation of their organization’s operational architecture to address intelligence requirements.  They integrate data science techniques, emerging technologies, and National Intelligence Community capabilities into their architecture. Marines are employed in the planning process and responsible for the development of an intelligence communications plan that integrates systems, software, personnel, and data within their organization. Intelligence Technology and Data Chiefs implement data security, Intelligence Community policy and guidelines, currently fielded operational equipment, available alternate technology, and emerging technology to interact with intelligence and non-intelligence data sources. Additional responsibilities include planning and deploying machine learning tools, neural networks, and artificial intelligence capabilities within their organization’s architecture.  Marines are assigned as data architects and function as senior advisors to the Chief Technology Officer Headquarters Marine Corps, the staff at the MEF and COCOM level, and in all levels of the Marine Air-Ground Task Force (MAGTF).\n",
    "moc_key": "2659",
    "moc_code": "2659",
    "moc_title": "Intelligence Technology and Data Chief",
    "moc_full_title": "2659 - Intelligence Technology and Data Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6399",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Duties encompass signals intelligence (SIGINT), electromagnetic warfare (EW), planning, personnel and asset management, collection management, analysis, dissemination efforts, and ensuring national-to-tactical SIGINT/EW integration. SIGINT/EW Chiefs also supervise the activities of personnel performing communications intercept, electronic reconnaissance, radio direction finding, analysis and reporting functions, intelligence support to CO, and EW operations. They may also be assigned to the intelligence staff marine corps forces special operations command (MARSOC), marine cryptologic support battalion (MCSB), radio battalions, marine littoral regiments (MLR), and the staff sections of the MEF information groups (MIG), marine divisions (MARDIV), marine corps forces commands, and marine aviation wings (MAW) supervising special security and special intelligence support functions. Additionally, they serve in staff billets as operational advisors designated by the commander or cognizant staff officer.\n",
    "moc_key": "2691",
    "moc_code": "2691",
    "moc_title": "Signals Intelligence/Electromagnetic Warfare Chief",
    "moc_full_title": "2691 - Signals Intelligence/Electromagnetic Warfare Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6404",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Digital Wideband Systems Maintainers are trained to install, diagnose, modify, and perform field level maintenance on digital wideband communications equipment used for high capacity, and satellite link communications. Typical duties include tuning and aligning systems, adjusting audio or data levels, using test equipment to make checks on circuit quality, diagnose equipment faults to the component level, and replace faulty parts or components at an organizational unit or intermediate maintenance activity. These Marines, submit field service requests, conduct technical research and order repair parts to restore Digital wideband Systems, and assist in the installation of Digital Wideband Systems. Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2831",
    "moc_code": "2831",
    "moc_title": "Digital Wideband Systems Maintainer",
    "moc_full_title": "2831 - Digital Wideband Systems Maintainer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6406",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ground Electronics Transmission Systems Maintainers are trained to install, diagnose, modify, perform field level maintenance on ground common transmission systems, digital fires situational awareness systems, vehicle intercommunications systems, vehicle electronics equipment, related electronic equipment, electronic jamming systems, and miscellaneous non-communication systems. Typical duties include the troubleshooting and repair of ground common radio systems, ground common tactical wideband transmission systems and related electronic equipment at an organizational unit or intermediate maintenance activity. These Marines, submit field service requests, conduct technical research and order repair parts to restore Digital wideband Systems, and assist in the installation of ground electronics transmission systems. Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2841",
    "moc_code": "2841",
    "moc_title": "Ground Electronics Transmission Systems Maintainer",
    "moc_full_title": "2841 - Ground Electronics Transmission Systems Maintainer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6407",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Electro-Mechanical/Information and Communication Technology Maintainers (EMICTM) are trained to install, diagnose, modify, and perform field level repairs on Marine Corps Information and Communication Technology systems and transmissions mediums. This includes End User Devices (EUD), live and recorded broadcasting technologies, telephony, wired and wireless network devices, optical transmissions systems and intelligence, surveillance, and reconnaissance (ISR) processing systems. Electro-Mechanical/Information and Communication Technology Maintainers are trained to diagnose, modify, and perform field level repairs on electro-mechanical devices to include, but not limited to unmanned, robotic, and multi-function systems involving motors, servoâ€™s, actuators and like devices and their control systems. Typical duties include the repair and modification of ground common Electro-Mechanical systems and sub-systems as well as repair and modification of Information and Communication Technology systems, and associated peripheral and interconnection devices utilizing visible or infrared carriers. These Marines, submit field service requests, conduct technical research and order repair parts to restore Electro-Mechanical/Information and Communication Technology systems. Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2847",
    "moc_code": "2847",
    "moc_title": "Electro-Mechanical/Information and Communication Technology Maintainer",
    "moc_full_title": "2847 - Electro-Mechanical/Information and Communication Technology Maintainer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6409",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ground Electronics Systems Maintenance Technicians are qualified to perform complex diagnosis, field level repairs, and modifications to ground electronics systems. These technicians supervise ground electronics systems maintenance activities and instruct in the use and maintenance of ground electronics communications systems. These technicians provide subject matter expertise in the diagnosis and repair of complex system and system of systems restoration across the spectrum of ground electronics to include but not limited to: Ground common transmission systems, digital fires situational awareness systems, vehicle intercommunications systems, vehicle electronics equipment, related electronic equipment, electronic jamming systems, Marine Corps Information and Communication Technology systems and transmissions mediums, including End User Devices (EUD), live and recorded broadcasting technologies, telephony, wired and wireless network devices, optical transmissions systems, intelligence, surveillance, and reconnaissance (ISR) processing systems, electro-mechanical devices to include, but not limited to unmanned, robotic, and multi-function systems involving motors, servoâ€™s, actuators and like devices and their control systems, digital wideband communications equipment used for high capacity, and satellite link communications, nonstandard equipment, and miscellaneous non-communication systems and components at organizational units and intermediate maintenance activities. Typical duties include complex field level repairs and modifications to ground electronics systems, supervision of a maintenance section or shop, coordination of equipment evacuation for repair with other maintenance activities, enforcing quality control measures and effective management of the maintenance cycle to include requisitioning of parts, monitoring maintenance reports and the management of internal shop programs. These technicians also provide technical assistance during the employment and installation of data/radio/satellite communication systems. This MOS is career progression for MOSs 2831, 2841 and 2847. MOS 2862 is assigned upon completion of the Electronics Maintenance Technician Course (M09DSJ1). Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2862",
    "moc_code": "2862",
    "moc_title": "Ground Electronics Systems Maintenance Technician",
    "moc_full_title": "2862 - Ground Electronics Systems Maintenance Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6410",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Calibration Technicians are qualified to perform calibration of high density, low complexity test measurement and diagnostic equipment (TMDE). Additionally, they are also qualified to repair and modify electrical/ electronic TMDE. Typical duties include the calibration of high density, low complexity TMDE and the repair and modification of electrical/electronic TMDE as necessary to include associated maintenance management and metrology documentation. Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2871",
    "moc_code": "2871",
    "moc_title": "Calibration Technician",
    "moc_full_title": "2871 - Calibration Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6411",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Metrology Technicians are qualified to calibrate precision electronic, mechanical, physical, optical, infrared, and laser Test Measurement and Diagnostic Equipment (TMDE) through use of higher order measurement standards.  Typical duties include supervising the operation of a calibration and TMDE maintenance facility to include such tasks as safeguarding and reporting of calibration results, maintaining accurate traceability to a higher echelon laboratory, and preparing and receiving shipments of delicate TMDE.  Duties also include the determination of calibration levels required based on equipment capabilities and user requirements, technical evaluation of calibration procedures, monitoring the capability of requirements of facility standards and submission of change requests, and the training of users in the proper care and operations of TMDE.  This MOS is a career progression for MOS 2871.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2874",
    "moc_code": "2874",
    "moc_title": "Metrology Technician",
    "moc_full_title": "2874 - Metrology Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6412",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Artillery Electronics Technicians are training to operate and maintain counter mortar radar systems, meteorological measuring systems, chronograph systems, and ancillary ground radar systems. tasks include the siting, installing, inspecting, testing, and repairing of the systems with emphasis on inspection. Artillery Electronics Technicians maintain necessary records on maintenance performed, hours of operation, and systems or component tests. MOS 2891, Electronics Maintenance Chief is assigned upon promotion to master sergeant and completion of required training. Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2887",
    "moc_code": "2887",
    "moc_title": "Artillery Electronics Technician",
    "moc_full_title": "2887 - Artillery Electronics Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6413",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Ground Electronics Systems Maintenance Chiefs perform staff duties in formulating and implementing maintenance plans to support tactical logistics in accordance with MCTP 3-40B. These maintenance chiefs will develop policies and procedures for ground electronics systems maintainers to perform inspection and classification; servicing, adjustment, and tuning; repair; modification; recovery and evacuation; overhauling and rebuilding; and testing and calibration of ground electronics systems equipment and miscellaneous electronics systems used by Marine Corps ground forces. As a senior staff noncommissioned officer in a highly technical field, the Electronics Maintenance Chief is qualified to manage the activities of ground electronics maintenance personnel from diverse maintenance specialties within the MAGTF. Duties may include teaching electronics theory and maintenance best practices, supervising a maintenance shop, writing evaluation test plans, and inspecting units performing electronics maintenance. This MOS is a career progression for Gunnery Sergeants with MOSs 2862 and 2887. Marines in this MOS may be assigned to a BIC (within their occupational field) that has been coded with one or more DoD cyber workforce framework (DCWF) work role codes. Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "2891",
    "moc_code": "2891",
    "moc_title": "Ground Electronics Systems Maintenance Chief",
    "moc_full_title": "2891 - Ground Electronics Systems Maintenance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6414",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Supply Chain and Materiel Management Specialists perform and monitor management and procedural application of manual or automated inventory control actions. These Marines must be able to design, plan, execute, control, and monitor supply chain activities with the objective of leveraging worldwide logistics, synchronizing supply with demand, measuring performance and facilitating accountability in retail and intermediate inventory activities and units. Additionally, these Marines prepare, maintain and control essential supporting documentation to document major events in capital asset’s lifecycle from acquisition, transference, sub-custody, and final disposition and/or disposal in support of existence and completeness. Advise and provide recommendations to the supply officer on all supply matters.\n",
    "moc_key": "3043",
    "moc_code": "3043",
    "moc_title": "Supply Chain Specialist",
    "moc_full_title": "3043 - Supply Chain Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6415",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Primary Military Occupational Specialties (PMOS) 3044 is a lateral move into the operational contract support specialist (OCS) career field. The PMOS integrates highly qualified enlisted Marines into the acquisition field whose mission is to deploy in support of the full range of military operations (ROMO), as directed under the department of defense (DoD). The senior enlisted Marine assigned to a Marine Corps field contracting systems (MCFCS) office will screen Marines seeking lateral move into this PMOS for recommendation. Marines recommended for lateral move will submit a package for approval to the operational contract support-specialist screening board (OCS-SSB). Marines approved for lateral move into this PMOS will be designated members of the Defense Acquisition Workforce and Contingency Contracting Force (CCF), which is governed under references (co) and (cp). Required fundamental training standards for the CCF across DoD are mandated by reference (co). Marines in this PMOS are equipped with the contracting fundamentals required to procure supplies and services for operations, exercises, contingencies, natural disasters, foreign training events, garrison environments, and advise senior leaders in business solutions and concepts. Supplies and services will be procured in accordance with governing regulations. Marines in this PMOS must have the ability to communicate effectively in order to interact with other branches of the DoD, civilian and military workforce, the commercial sector, host nations and their workforce. Marines in this PMOS may participate in formal apprenticeship programs leading to a Department of Labor Certificate of Apprenticeship; refer to reference (bs) for specific information concerning the united services military apprenticeship program (USMAP). Overall, Marines are required to operate independently self-manage workloads, apply sound business management principles, fulfill acquisition workforce continuous learning requirements, and pursue higher education.\n",
    "moc_key": "3044",
    "moc_code": "3044",
    "moc_title": "Operational Contract Support Specialist",
    "moc_full_title": "3044 - Operational Contract Support Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "13899",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Supply Chain Managers are required to have a tactical understanding in the execution of supply chain functions and programs, some which are unique to the service and Department of Defense. Supply Chain Managers manage flows of goods, services, finance, and knowledge for an effective and efficient end-to-end supply chain to support enterprise strategic objectives. Supply Chain Managers perform all functions related to ground supply operations, to include customer service support, life cycle management, warehousing, financial management, inventory management, storage operations management and return for excess or defective product. Additionally, these Marines will be familiar with the impacts of supply chain management to operational-level logistics required to support distributed and expeditionary operations. Supply Chain Managers provide maximum flexibility to Commanders to tailor their units based on assigned missions and operational requirements. They will serve in one of the following commands: operating forces unit, a non-operating forces activity, or a supporting establishment. Advise and provide recommendations to the supply officer on all supply matters. This MOS is a career progression for corporals with MOSs 3043 and 3051.\n",
    "moc_key": "3047",
    "moc_code": "3047",
    "moc_title": "Supply Chain Manager",
    "moc_full_title": "3047 - Supply Chain Manager",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6416",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Inventory Management Specialists perform various duties within logistics chain management to include receiving, inspecting, locating, storing, rotating (first in-first out), safekeeping, issuing, preparing, shipping, material return, and disposal of materiel and equipment. These clerks maintain automated or manual locator systems in order to conduct inventories, maintain records of issued durable goods, and monitor shelf-life items; separate and handle hazardous material according to its classification and as indicated by material safety data sheets; input data entry transactions, and retrieval of historical records. They utilize and maintain handheld optical character recognition scanners, devices, and multimedia retrieval systems. These Marines are licensed to operate material handling equipment (MHE) in both garrison and deployed environments as well as operate bulk and small parts conveyer systems used in automated warehousing operations. Marines assigned to this occupational field receive, sort, document, and store inventory as well as prepare, pack, and issue inventory in open, enclosed, and hazardous material storage areas. They will use detailed technical data for the development and execution of a care and storage requirements to include the development of storage space requirements, per weight, cube, and clearance factors by categories of supply.\n",
    "moc_key": "3051",
    "moc_code": "3051",
    "moc_title": "Inventory Management Specialist",
    "moc_full_title": "3051 - Inventory Management Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "9548",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Distribution Specialists are educated, equipped, and trained to manage fleet marine force requirements at the tactical, operational, strategic, and enterprise level.  The specialists use Federal, DoD, and service regulations, the defense transportation system (DTS), commercial modes of transportation, and distribution logistic functions to enable optimal selection and procurement of commercial and government-operated land, air, and sea transportation services.  They use a variety of automated systems in the performance of their duties.  Warehousing, rail, motor and air terminal operations, materiel handling, packing, packaging, preservation, and marking are daily operations.  Distribution Specialists perform technical distribution management duties pertaining to movement of civilian and military personnel and their eligible family members both individually and in groups, using all modes of transportation.  This includes planning for troop movements via chartered air, train, or bus, as well as port calls for overseas permanent change of station.  The specialists perform personal property counseling interviews to advise members and eligible family members of their personal property shipping entitlements.  The specialists perform additional operational duties and tasks at military and commercial air terminals.  The specialists perform passport and visa services by counseling members and dependents on required documents, foreign clearance regulations, and by aiding in the preparation and submission of required correspondence to the Department of State and foreign embassies.  This includes preparing all freight shipment documents to manifest cargo and passengers aboard government or commercial chartered conveyances.  At the operational level, specialists perform in-theater sustainment receiving, shipping, in-transit visibility, and distribution functions.\n",
    "moc_key": "3152",
    "moc_code": "3152",
    "moc_title": "Distribution Specialist",
    "moc_full_title": "3152 - Distribution Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6420",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Food Service Specialists function in the garrison and field environments in every aspect of food preparation and cooking, program management and administration, procurement, storage, and distribution of subsistence supplies; requisitioning, purchasing, receiving, accountability, rotating (first in-first out), and safekeeping of subsistence supplies, meal activity and consumption reporting. Additionally, they perform various duties within the Class I logistics chain management to include receiving, inspecting, locating, storing, issuing, preparing, shipping, material return, and disposal of materiel and equipment. Food Service Specialists maintain and operate automated information technology systems in order to maintain accountability of all subsistence inventories, input data entry transactions and retrieval of historical records; maintain records of perishable and non-perishable subsistence supplies, maintain record of Class I subsistence issued, and monitor shelf-life items. In support of the maritime prepositioning force (MPF) program and the marine corps prepositioning program-Norway (MCPP-N), they ensure that combat feeding platforms (e.g., combat rations and field feeding equipment) are tailored and aligned with maritime expeditionary warfare capabilities through the prepositioning network. When assigned to an installation food service program office, they perform quality assurance surveillance of food service contracts. The most senior grades act as senior enlisted advisors and administrative assistants to the food service officer/food service operations officer. These specially trained technicians are also responsible for the design and functional layout of expeditionary field feeding sites employed for military operations and humanitarian aid. Marines of the 3381 occupational specialties also provide expeditionary Class I feeding support for marine expeditionary units (MEUs) and airfields.\n",
    "moc_key": "3381",
    "moc_code": "3381",
    "moc_title": "Food Service Specialist",
    "moc_full_title": "3381 - Food Service Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6421",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Finance Technicians perform the duties associated with the maintenance, review, payments processing of master pay accounts, and the fiscal accounting supporting the transactions.  Finance Technicians also perform duties incident to the adjudication, computation, review, and payment of vouchers of reimbursement for official travel.  Finance Technicians staff NCOs supervise subordinates working in master pay accounts and/or official travel payment functions.  Finance Technicians may be assigned to finance offices in either the operating forces or the shore establishment.  Marines serving as Finance Technicians must have a fundamental understanding of related computer system applications.\n",
    "moc_key": "3432",
    "moc_code": "3432",
    "moc_title": "Finance Technician",
    "moc_full_title": "3432 - Finance Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6422",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Financial Management Resource Analysts perform accounting, budgeting and all other financial management relevant duties for appropriated funds supporting the operating forces and supporting establishments. Financial Management Resource Analysts duties include the maintenance, monitoring, reconciliation and preparation of official accounting records; general ledger control; related cost accounting; financial systems analysis and any oversight duties typically performed by related cost accounting organizations. Financial Management Resource Analysts enter cost accounting data in business process systems to establish financial data parameters for end users. Financial Management Resource Analysts gather and transform data into information by generating reports and building data models to analyze results and make forecasts. Financial Management Resource Analysts present information to support recommendations for business process improvement, internal controls, and informed decision-making related to financial management. The aforementioned duties require a proficient understanding of all financial management-related system interfaces and associated computer applications.\n",
    "moc_key": "3451",
    "moc_code": "3451",
    "moc_title": "Financial Management Resource Analyst",
    "moc_full_title": "3451 - Financial Management Resource Analyst",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6423",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Automotive Maintenance Technician services, inspects, maintains, and repairs motor transport equipment at the field level.\n",
    "moc_key": "3521",
    "moc_code": "3521",
    "moc_title": "Automotive Maintenance Technician",
    "moc_full_title": "3521 - Automotive Maintenance Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6426",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Motor Transport Maintenance Chief (MTMC) supervises the maintenance, repair and inspection of motor transport equipment, directs the activities of assigned enlisted personnel in a motor transport maintenance repair shop or facility.  The MTMC assists with all duties and responsibilities under the cognizance of the Motor Transport Maintenance Officer.\n",
    "moc_key": "3529",
    "moc_code": "3529",
    "moc_title": "Motor Transport Maintenance Chief",
    "moc_full_title": "3529 - Motor Transport Maintenance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6427",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Motor Vehicle Operators inspect, operate, and manage medium and heavy wheeled vehicles in a variety of terrain and weather conditions to transport troops, supplies, and equipment in support of combat and/or garrison operations. Motor Vehicle Operators perform operator/crew level maintenance, maintain required forms, and manage associated tools and equipment of the medium and heavy fleet. Motor Vehicle Operators are only responsible for the management and oversite the operations of light tactical vehicles. Employs land navigation techniques and must be knowledgeable with the operation of radios and weapons when they are mounted on the vehicle. Responsible for convoy security and the tactical employment of the 7.62mm medium machine-gun, the 50-cal machine-gun, and 40mm heavy machine-gun, and their support vehicle during convoy operations. Responsible for the organizations licensing requirements and program management.\n",
    "moc_key": "3531",
    "moc_code": "3531",
    "moc_title": "Motor Vehicle Operator",
    "moc_full_title": "3531 - Motor Vehicle Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6430",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "A Motor Transport Operations Chief is responsible to the commander and assists in the planning, training, licensing, deployment and employment of all operator/crew level maintenance. Also responsible for the planning and execution of motor transport operations, directs the activities of all 353X enlisted personnel in a motor pool, conducts motor vehicles accident/mishap investigations and prepares accident/mishap reports.  The Motor Transport Operations Chief coordinates the preparation and assignment of motor transport personnel/equipment in accordance with the Table of Organization/Table of Equipment of their unit.  The Motor Transport Operation Chief acts as the Fleet Manager, Truck Transportation Coordinator,  and assists with all duties and responsibilities under the cognizance of the Motor Transport Officer.\n",
    "moc_key": "3537",
    "moc_code": "3537",
    "moc_title": "Motor Transport Operations Chief",
    "moc_full_title": "3537 - Motor Transport Operations Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6431",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Marine Corps Community Services Marines are responsible for myriad of MCCS duties as outlined in the Introduction section above.  They also provide direct customer service and support; perform daily administrative tasking; provide managerial and custodial supervision of personnel, funds, property and merchandise; conduct inventories, purchasing, receiving, storage and issuing inventory/merchandise; and setting up and managing tactical Field Exchanges and other MCCS support services in a deployed environment.\n",
    "moc_key": "4133",
    "moc_code": "4133",
    "moc_title": "Marine Corps Community Services Marine",
    "moc_full_title": "4133 - Marine Corps Community Services Marine",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6434",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Legal Services Specialist MOS encompasses every facet of legal administration. General duties involve the legal operational, managerial, clerical and administrative duties incident to an LSSS, LSST, or OSJA. Typical duties include research, preparation and typing of general correspondence, forms, reports, wills, powers of attorney, and other documents dealing with legal and quasi-legal matters; checking all completed work for typographic accuracy; maintaining office correspondence files, directives and publications; if senior in grade, will act as the legal services chief and senior enlisted advisor directly responsible to the OIC/SJA for the overall assignment, performance, training, counseling, morale, discipline and welfare of all enlisted personnel. The Legal Services Chief is the active liaison between the command dealing with enlisted policy and duty assignments and advisor to the judge advocates with regard to enlisted instruction and supervision. Selected Marines may attend follow-on training at the Legal Services Court Reporter Course.\n",
    "moc_key": "4421",
    "moc_code": "4421",
    "moc_title": "Legal Services Specialist",
    "moc_full_title": "4421 - Legal Services Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7616",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Combat Graphics Specialist conceptualizes and creates graphics and layout and design products in both electronic and print formats. These products support communication to internal, domestic and international audiences; commanders’ information requirements; and all other operations, garrison, training, and recruiting requirements. Typical duties include, but are not limited to: planning and creating graphics and illustration products; conducting layout and design of digital products; writing; tailoring products for different audiences and mediums (print, broadcast, audio visual, web-based, social media, face-to-face, etc.); broadcasting; supporting news media queries and escorts; supporting community engagement programs; executing marketing programs for recruiting; supporting combat investigations and documentation; conducting high-volume printing and finishing in multiple formats and sizes; transmitting and archiving products; creating traditional/hand-drawn art products; and performing equipment inspections and preventive maintenance.\n",
    "moc_key": "4512",
    "moc_code": "4512",
    "moc_title": "Combat Graphics Specialist",
    "moc_full_title": "4512 - Combat Graphics Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7618",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Combat Photographer conceptualizes, acquires and produces still imagery products using digital cameras and accessories (e.g., lenses, flashes, night vision devices). These products support communication to internal, domestic and international audiences; commander’s information requirements; and all other operations, garrison, training, and recruiting requirements. Typical duties include, but are not limited to: planning in order to meet communication/operational end state; developing a shot list; acquiring images in studio, field, and combat environments using the principles of photographic composition; selecting and editing images for layout; writing; tailoring products for different audiences and mediums (print, broadcast, audio visual, web-based, social media, face-to-face, etc.); broadcasting; supporting news media queries and escorts; supporting community engagement programs; executing marketing programs for recruiting; supporting administrative, legal, investigation, and combat documentation; conducting photographic finishing, visual and electronic quality control; transmitting and archiving; performing equipment inspections and preventive maintenance.\n",
    "moc_key": "4541",
    "moc_code": "4541",
    "moc_title": "Combat Photographer",
    "moc_full_title": "4541 - Combat Photographer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7619",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Combat Videographer conceptualizes, plans, acquires and produces motion imagery products using digital video cameras and editing equipment. These products support communication to internal, domestic and international audiences; commanders’ information requirements; and all other operations, garrison, training, and recruiting requirements. Typical duties include, but are not limited to: planning in order to meet communication/operational end state; developing a story board; acquiring video in studio, field, and combat environments using the principles of video composition; selecting and editing motion imagery; writing scripts; using closed captioning, audio, graphics, and special effects; tailoring products for different audiences and mediums (print, broadcast, audio visual, web-based, social media, face-to-face, etc.); broadcasting; supporting news media queries and escorts; supporting community engagement programs; executing marketing programs for recruiting; supporting administrative videography, legal, investigation, and combat documentation; digitizing and rendering video; conducting visual and electronic quality control; transmitting and archiving; performing equipment inspections and preventive maintenance.\n",
    "moc_key": "4571",
    "moc_code": "4571",
    "moc_title": "Combat Videographer",
    "moc_full_title": "4571 - Combat Videographer",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "7620",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The Communication Strategy and Operations (COMMSTRAT) Chief assists the COMMSTRAT Officer, Visual Information Officer (VIO), and/or COMMSTRAT Planner in communication planning and execution, and is proficient in the technical aspects of written and visual communication, to include product development, equipment and equipment management, and software. The COMMSTRAT Chief conducts these activities in support of operations, garrison, training, and recruiting requirements. Typical duties include, but are not limited to: employing, training, and deploying 45XX OccFld personnel and equipment; overseeing and supervising daily operations; advising leadership on communication matters; participating in operational, Service and communication planning; conducting communication integration and synchronization; engaging with internal, domestic and international audiences via traditional news media, social and emerging media, and face-to-face communication; and supervising the production of communication (written and visual information) products. COMMSTRAT Chiefs serve as enlisted technical advisors and may assume the duties as the COMMSTRAT Officer or VIO in their absence, to include performing the administrative duties normally assigned to those officers. Staff Sergeants will also execute select duties and responsibilities found within the 4512, 4541 and 4571 PMOSs. Marines with the 4511 AMOS earned upon successful completion of a tour as an RS MAC are eligible for future assignment as COMMSTRAT Chiefs at the district and national level within MCRC; a successful tour as an RS MAC is a requirement of those billets.\n",
    "moc_key": "4591",
    "moc_code": "4591",
    "moc_title": "Communication Strategy and Operations Chief",
    "moc_full_title": "4591 - Communication Strategy and Operations Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6440",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Career Counselor serves as the commander's primary advisor for enlisted retention matters and is crucial in guiding and assisting enlisted personnel in their career development across Marine Corps enlisted components. The Career Counselor must be thoroughly knowledgeable of the reenlistment process, to include prospecting, reenlistment ceremonies, career information programs, and associated policies. They further provide valuable guidance and support to service members. This MOS will be assigned and voided only by the authority of the CMC (MM).\n",
    "moc_key": "4821",
    "moc_code": "4821",
    "moc_title": "Career Counselor",
    "moc_full_title": "4821 - Career Counselor",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6442",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Musicians perform on musical instruments in a Marine Corps band in concerts, parades, band drills, honor guards, guard mounts, and various other official functions and ceremonies. Musicians also train or assist in the training of musician personnel, perform other additional duties as required, such as section leader, supply NCO, music librarian, storeroom keeper, arranger, and conduct preventive maintenance for musical equipment.",
    "moc_key": "55xx",
    "moc_code": "55XX",
    "moc_title": "Musician",
    "moc_full_title": "55XX - Musician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6443",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "CBRN Defense Specialists operate within the unit combat operations center to assist the staff in monitoring unit operations, facilitating warning and reporting, and coordinating CBRN response activities.  CBRN Defense Specialists train personnel to employ individual and organizational CBRN equipment and execute individual survival measures to enable protective actions and sustain operations in a CBRN environment.  CBRN Defense Specialists collect, analyze and provide information relative to CBR exposure status, location of contaminated areas and CBRN defense. Additionally, CBRN Defense Specialists maintain and prepare CBRN defense equipment for embarkation, deployment, and employment.  This MOS is assigned and voided only by the authority of the CMC (MM).\n",
    "moc_key": "5711",
    "moc_code": "5711",
    "moc_title": "Chemical, Biological, Radiological, and Nuclear (CBRN) Defense Specialist",
    "moc_full_title": "5711 - Chemical, Biological, Radiological, and Nuclear (CBRN) Defense Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "10669",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "The CBRN Defense Chief serves as a CBRN defense SME to advise the staff and coordinate CBRN defense, reconnaissance, and decontamination operations. CBRN Defense Chiefs plan, coordinate and monitor the employment of unit CBRN defense, reconnaissance, and decontamination equipment, and attached capabilities, and serve in the unit combat operations center to perform CBRN warning and reporting, and coordinate CBRN response activities. In addition to advising the Commander on the operational and technical functions associated with CBRN defense, CBRN reconnaissance, CBRN response, and CBRN decontamination, senior-level management Marines (MGySgt to MSgt) also advise the commander and staff on events related to supporting countering weapons of mass destruction (CWMD) in support of combatant command lines of effort and objectives within the supported area of operations. CBRN Defense Chiefs at MSC and higher or joint commands are responsible to assist the CBRN Defense Officer with integrating the execution of CWMD in plans, exercises, and operations through organization, training, and planning. They support operations across the spectrum of special operations as fully integrated special staff members in a variety of special operations forces or joint task organized configurations.\n",
    "moc_key": "5769",
    "moc_code": "5769",
    "moc_title": "Chemical, Biological, Radiological and Nuclear (CBRN) Defense Chief",
    "moc_full_title": "5769 - Chemical, Biological, Radiological and Nuclear (CBRN) Defense Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6444",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Military Police perform assigned military law enforcement duties to uphold the criminal justice system, maintain good order and discipline, and support the commander's law enforcement and security requirements in peacetime and combat operations. Typical duties and billets include foot and motorized patrol, control of pedestrian and vehicular traffic, crime prevention/physical security, patrolman, fire team, squad leader, watch commander, platoon sergeant, operations chief, and provost sergeant billets.\n",
    "moc_key": "5811",
    "moc_code": "5811",
    "moc_title": "Military Police",
    "moc_full_title": "5811 - Military Police",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6450",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Criminal Investigation Division Agents perform criminal investigative duties while operationally assigned to the criminal investigation division (CID), regional trial counsel (RTC), and naval criminal investigative service (NCIS). CID Agents provide criminal investigative support to both supporting establishment law enforcement and deployed/combat contingency operations. CID Agents investigate misdemeanor and felony level crimes that fall within the jurisdictional purview of the DOD, provide technical guidance supervision to junior CID Agents and apprentice investigators, conducts covert operations, personal protective services, crisis negotiations, forensic examinations/exploitation, assists the complex trial teams with trial case preparation, provides subject matter expertise and training to host nations during contingency operations and liaise with other military, local, state and federal law enforcement agencies.\n",
    "moc_key": "5821",
    "moc_code": "5821",
    "moc_title": "Criminal Investigator (CID) Agent",
    "moc_full_title": "5821 - Criminal Investigator (CID) Agent",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6452",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Correctional Specialists guard and provide 24-hour supervision of the daily activities of confined personnel at military correctional facilities (MCFs) to prevent disturbances and escapes. Correctional Specialists perform routine inspections, process personnel for confinement and release, transport prisoners, absentees and deserters; manage prisoner's funds and personal property, observe and report meaningful changes in prisoner behavior, report conduct investigations on infractions of the MCFs published regulations, investigate the whereabouts of military deserters to facilitate their swift return to military control, and conduct investigations in support of Provost Marshals Office operations. Corrections Specialist also provide commanders with the capability to execute regional detention facilities in theater with immediate oversight and subject matter expertise on the safe, humane and efficient care of enemy detainees entrusted to their care. Typical duties and billets include Escort, Dorm Supervisor, Master Control Supervisor, Mess Deck Supervisor, Duty Driver, Duty Brig Supervisor, Command Investigator, Administration Chief, Programs Chief, and Operations Chief billets.\n",
    "moc_key": "5831",
    "moc_code": "5831",
    "moc_title": "Correction and Detention Specialist",
    "moc_full_title": "5831 - Correction and Detention Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6454",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Communication Systems Technicians are qualified to perform/supervise diagnosis, field level repairs, and modifications to communications systems found within selected units of the Marine Air Control Group.  Typical duties include installation, operation, performance testing, troubleshooting and repair of voice communications equipment, fiber optic cables, switched local area networks and devices, end-user computers, and system software/firmware for voice communications equipment used within the Marine Air Command and Control Systems (MACCS).  Additional duties include supervision of a maintenance section/shop, coordination of equipment evacuation for repair with other maintenance activities, requisitioning of parts, and monitoring maintenance reports.  These technicians also provide technical expertise in the planning, employment, and installation of aviation communications systems.\n",
    "moc_key": "5939",
    "moc_code": "5939",
    "moc_title": "Aviation Communication Systems Technician",
    "moc_full_title": "5939 - Aviation Communication Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6455",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation RADAR Technicians site, install, operate, test, adjust, align, and repair the Marine Air Command Control Systems (MACCS) Air Defense RADAR Systems, and associated Identification Friend or Foe (IFF) equipment.  Typical duties include installation, operation, performance testing, and troubleshooting and repair of RADAR equipment, fiber optic cables, switched local area networks and devices, end-user computers, servers, and system software/firmware for RADAR equipment.  Additional duties include supervision of a maintenance section/shop, coordination of equipment evacuation for repair with other maintenance activities, requisitioning of parts, and monitoring maintenance reports.  These technicians also provide technical expertise in the planning, employment, and installation of Air Defense RADAR Systems.\n",
    "moc_key": "5948",
    "moc_code": "5948",
    "moc_title": "Aviation RADAR Technician",
    "moc_full_title": "5948 - Aviation RADAR Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6456",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Meteorological Equipment Maintenance Technicians survey, site, and install meteorological equipment. They process and pack system components for storage or shipment. Make periodic inspections and perform preventive maintenance. Tune, adjust, and align systems for proper operation. Use proper safety procedures in system maintenance and operation. Diagnose and isolate malfunction(s) to the fault, remove and replace the fault, and verify that the malfunction(s) has been corrected. Install, operate, configure, and troubleshoot switched local area networks, devices, end-user computers, and system software/firmware as it relates to meteorological equipment. Maintain tools, support, and test equipment. Assist in maintaining the technical library. Assist in maintaining accountability of all parts of the system, including spare parts, and in requisitioning supplies and spare parts. Maintain necessary records of maintenance and compile data for reports. Assist ATC Maintenance Personnel in MOS 5952, 5953, and 5954. Must possess a working knowledge of applicable Naval Aviation Maintenance Programs.\n",
    "moc_key": "5951",
    "moc_code": "5951",
    "moc_title": "Aviation Meteorological Equipment Technician, OMA/IMA",
    "moc_full_title": "5951 - Aviation Meteorological Equipment Technician, OMA/IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6457",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Traffic Control Navigational Aids Technicians survey, site, and install air traffic control navigational aids and instrument landing systems.  Make periodic inspections and perform preventive maintenance.  Tune, adjust, and align systems for proper operation.  Use proper safety procedures in system maintenance and operation.  Diagnose and isolate malfunction to the fault, remove and replace the fault, and verify that the malfunction has been corrected.  Participate in and provide technical assistance during system flight inspections.  Maintain tools, support, and test equipment.  Assist in maintaining the maintenance technical library.  Assist in maintaining accountability of all parts of the system, including spare parts, and in requisitioning supplies and spare parts.  They process and pack system components for storage or shipment.  Train subordinates or less qualified personnel.  Maintain necessary records of maintenance and compile data for reports.  Assist Air Traffic Control Maintenance Personnel in MOS 5951, 5953, and 5954.  Must possess a working knowledge of applicable Naval Aviation Maintenance Programs.\n",
    "moc_key": "5952",
    "moc_code": "5952",
    "moc_title": "Air Traffic Control Navigational Aids Technician",
    "moc_full_title": "5952 - Air Traffic Control Navigational Aids Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6458",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Traffic Control RADAR Technicians survey, site, and install air traffic control precision approach and surveillance radar systems.  Make periodic inspections and perform preventive maintenance.  Load operational software, tune, adjust, and align systems for proper operation.  Use proper safety procedures in system maintenance and operation.  Diagnose and isolate malfunction to the fault, remove and replace the fault; and verify that the malfunction has been corrected.  Participate in and provide technical assistance during system flight inspections.  Maintain diagnostic and operational tapes, tools, support, and test equipment.  Assist in maintaining the maintenance technical library.  Assist in maintaining accountability of all parts of the system including software, spare parts, and in requisitioning supplies and spare parts.  Process and pack system components for storage or shipment.  Train subordinates or less qualified personnel.  Maintain necessary records of maintenance and compile data for reports.  Assist Air Traffic Control Maintenance Personnel in MOS 5951, 5952 and 5954.  Must possess a working knowledge of applicable Naval Aviation Maintenance Programs.\n",
    "moc_key": "5953",
    "moc_code": "5953",
    "moc_title": "Air Traffic Control RADAR Technician",
    "moc_full_title": "5953 - Air Traffic Control RADAR Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6459",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Traffic Control Communications Technicians survey, site, and install air traffic control communications systems.  Make periodic inspections and perform preventive maintenance.  Tune, adjust, and align systems for proper operation.  Use proper safety procedures in system maintenance and operation.  Diagnose and isolate malfunction to the fault, remove and replace the fault, and verify that the malfunction has been corrected.  Participate in and provide technical assistance during system flight inspections.  Maintain tools, support, and test equipment.  Assist in maintaining the maintenance technical library.  Assist in maintaining accountability of all parts of the system, including spare parts, and in requisitioning supplies and spare parts.  They process and pack system components for storage or shipment.  Train subordinates or less qualified personnel.  Maintain necessary records of maintenance and compile data for reports.  Assist Air Traffic Control Maintenance Personnel in MOS 5951, 5952 and 5953.  Must possess a working knowledge of applicable Naval Aviation Maintenance Programs.\n",
    "moc_key": "5954",
    "moc_code": "5954",
    "moc_title": "Air Traffic Control Communications Technician",
    "moc_full_title": "5954 - Air Traffic Control Communications Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6460",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Traffic Control Systems Maintenance Chiefs supervise, coordinate, and instruct enlisted personnel in the performance of air traffic control maintenance functions.  Provide information concerning the capabilities, limitations, and reliability of air traffic control systems and equipment.  Instruct operation and maintenance of air traffic control systems.  Perform staff support duties in formulating and implementing maintenance and supply plans, provisioning air traffic control systems, and preparing publications and training materials.  Supervises surveying, siting, installation, modification, and maintenance tasks.  Supervise Air Traffic Control Maintenance Personnel in MOSs 5951, 5952, 5953, and 5954.  Must possess a working knowledge of applicable Marine Corps Ground Equipment and Naval Aviation Maintenance Programs.\n",
    "moc_key": "5959",
    "moc_code": "5959",
    "moc_title": "Air Traffic Control Systems Maintenance Chief",
    "moc_full_title": "5959 - Air Traffic Control Systems Maintenance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6461",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Tactical Data Systems Technicians are qualified to perform/ supervise diagnosis, field level repairs, and modifications to communications data systems found within selected units of the Marine Air Control Group.  Typical duties include installation, operation, configuration, troubleshooting, and repair of fiber optic cables, switched local area networks and devices, end-user computers, servers, virtual systems and servers, and system software/firmware for equipment used within the Marine Air Command and Control Systems (MACCS).  Additional duties include supervision of a maintenance section/shop, coordination of equipment evacuation for repair with other maintenance activities, requisitioning of parts, and monitoring maintenance reports.  These technicians also provide technical expertise in the planning, employment, and installation of aviation command and control systems.  Marines in this MOS may be assigned to a BIC [within their occupational field] that has been coded with one or more DoD Cyber Workforce Framework (DCWF) work role codes.  Please reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with these work role codes.\n",
    "moc_key": "5974",
    "moc_code": "5974",
    "moc_title": "Tactical Data Systems Technician",
    "moc_full_title": "5974 - Tactical Data Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6462",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Defense Systems Technicians are qualified to perform and/or supervise the diagnosis, field-level repair, and modifications to electronic systems and sub-systems found within selected units within the Marine Air Control Group and the Marine Littoral Regiment. Typical duties include the installation, operation, troubleshooting, and maintenance of the MADIS air defense RADAR systems (active and passive), radio communications equipment, Tactical Data Link (TDL) equipment, networking and data storage devices, and software/firmware configuration for Ground Based Air Defense (GBAD) equipment. These duties can be executed as part of a crew construct as the System Configuration Manager or as part of a maintenance platoon. Additional duties include the operation of TDLs, supervision of a maintenance platoon, coordination of equipment evacuation for repair with other maintenance activities, requisitioning of parts, and monitoring maintenance reports. These technicians also provide technical expertise in planning, employing, installing, and integrating aviation command and control systems.\n",
    "moc_key": "5979",
    "moc_code": "5979",
    "moc_title": "Tactical Air Operations/Air Defense Systems Technician",
    "moc_full_title": "5979 - Tactical Air Operations/Air Defense Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6463",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Electronics Maintenance Chiefs (Aviation (C2)) supervise, coordinate, and instruct enlisted personnel in the operation and maintenance of Marine Air Command and Control Systems (MACCS). Provide information concerning the employment, capabilities, limitations, and reliability of the MACCS and other equipment. Perform staff support duties in formulating and implementing maintenance and supply plans, provisioning the MACCS, and preparing publications and training materials. Supervises surveying, siting, installation, modification, and maintenance tasks. Supervise Maintenance Personnel in MOSs 5939, 5948, 5974, and 5979. Must possess a detailed, working knowledge of all applicable Marine Corps and Navy maintenance programs.\n",
    "moc_key": "5993",
    "moc_code": "5993",
    "moc_title": "Electronics Maintenance Chief (Aviation (C2))",
    "moc_full_title": "5993 - Electronics Maintenance Chief (Aviation (C2))",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6466",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Maintenance Chiefs are directly responsible to the Commanding Officer for the establishment and sustainment of all maintenance areas and functions within a fixed-wing, rotary-wing, tilt-rotor, and aviation logistics squadron or repair facility.  Their leadership and expertise are essential to the success of the unit.  They are the Senior Enlisted Maintenance Advisors to the Commanding Officer (CO) for all maintenance Marines’ qualifications and professional development.  They report to the Aircraft Maintenance Officer (AMO) on all matters affecting aircraft maintenance and maintenance personnel.  They assist in the planning, management, supervision, and execution of all scheduled and unscheduled maintenance and flight operations.\n",
    "moc_key": "6019",
    "moc_code": "6019",
    "moc_title": "Aircraft Maintenance Chief",
    "moc_full_title": "6019 - Aircraft Maintenance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6469",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Support Equipment (SE) Asset Managers manage assets under the cognizance of the aircraft maintenance material readiness list (AMMRL) program, the F-35 lightning II program joint fleet management plan, and the United States marine corps F-35 integrated sustainment plan. They are responsible for SE physical and administrative inventory accountability, fleet management, and requirements validation utilizing the Department of Navy’s Support Equipment Management System (SEMS), and the F-35 lightning II joint program office’s lighting II support equipment management system (LSEMS). They manage SE assets at the organizational and intermediate levels of maintenance via the O-level squadrons, marine aviation logistics squadrons (MALS), marine aircraft wings (MAW), type commander (TYCOM) and naval air systems command support equipment controlling authorities (SECA), marine forces commands (MARFORs), and Headquarters Marine Corps (HQMC). They use logistical management techniques, supply chain procedures, technical publications, automated data processing equipment to conduct, reconcile, and report SE asset inventories; acquire and dispose of SE assets; train subordinate SE asset managers, validate requirements, conduct liaison with the SECA, and inform higher headquarters or adjacent commands on applicable SE management policies or aviation logistics strategy and plans.\n",
    "moc_key": "6042",
    "moc_code": "6042",
    "moc_title": "Aviation Support Equipment Asset Manager",
    "moc_full_title": "6042 - Aviation Support Equipment Asset Manager",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6471",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Maintenance Data Specialists maintain aircraft logs and records and optimized organizational/ intermediate maintenance automated log sets. They receive or compile items for receipt or transfer of aircraft, including relocation of aircraft to or from a D-level facility for standard rework. They report flight loads, launch, and landing data and make required logbook entries. They screen technical directives for applicability to assigned aircraft and related equipment. They obtain the naval aircraft flight record flight information to maintain applicable logbook and records. They will initiate, maintain, closeout, reinitiate, and dispose of logbook/records. They maintain local records on items that have a service life and monitor accumulations of forced removal items. They prepare reports and correspondence within aircraft maintenance and repair activities. They are responsible for trend interpretation in support of aviation information and readiness reporting requirements to aid maintenance supervisors and logisticians in the performance of their assigned tasks.\n",
    "moc_key": "6046",
    "moc_code": "6046",
    "moc_title": "Aviation Maintenance Data Specialist",
    "moc_full_title": "6046 - Aviation Maintenance Data Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6559",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Flight Equipment Technicians inspect, maintain, and repair parachutes; flight survival equipment; flight equipment; carbon dioxide, and gaseous and liquid oxygen equipment.\n",
    "moc_key": "6048",
    "moc_code": "6048",
    "moc_title": "Flight Equipment Technician",
    "moc_full_title": "6048 - Flight Equipment Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6473",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Intermediate Level Hydraulic/Pneumatic Mechanics inspect, maintain, and repair aircraft intermediate level hydraulic/pneumatic system components.\n",
    "moc_key": "6062",
    "moc_code": "6062",
    "moc_title": "Aircraft Intermediate Level Hydraulic/Pneumatic Mechanic",
    "moc_full_title": "6062 - Aircraft Intermediate Level Hydraulic/Pneumatic Mechanic",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6475",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Support Equipment Electrician/Refrigeration and Engine/Gas Turbine Technicians inspect, test, maintain, and repair aircraft support equipment (SE), electricial/refrigeration and engine/gas turbine systems and systems components.  Perform duties related to the operation of support equipment.  Perform duties related to the licensing of aircraft maintenance personnel in the operation of support/special support equipment.\n",
    "moc_key": "6073",
    "moc_code": "6073",
    "moc_title": "Support Equipment Electrician/Refrigeration and Engine/Gas Turbine Technician",
    "moc_full_title": "6073 - Support Equipment Electrician/Refrigeration and Engine/Gas Turbine Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6476",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Cryogenics Equipment Operators assemble, operate, and maintain liquid oxygen/nitrogen generating plants, storage and aircraft servicing equipment, vaporizing equipment, vacuum pumps, and LOX tank purging units.  They operate and maintain purity analysis test equipment to ensure product acceptability.\n",
    "moc_key": "6074",
    "moc_code": "6074",
    "moc_title": "Cryogenics Equipment Operator",
    "moc_full_title": "6074 - Cryogenics Equipment Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6477",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Intermediate Level Structures Mechanics inspect, maintain, and repair aircraft intermediate level structural components.\n",
    "moc_key": "6092",
    "moc_code": "6092",
    "moc_title": "Aircraft Intermediate Level Structures Mechanic",
    "moc_full_title": "6092 - Aircraft Intermediate Level Structures Mechanic",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6565",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The aircraft maintenance (rotary wing) mechanics provide direct and indirect support to inspect, maintain, test and repair helicopter/tiltrotor airframes and airframe components, dynamic components, power plants and power plant systems and to perform duties relating to flight line operation.",
    "moc_key": "61xx",
    "moc_code": "61XX",
    "moc_title": "Aircraft Maintenance (Rotary-Wing)",
    "moc_full_title": "61XX - Aircraft Maintenance (Rotary-Wing)",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6566",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The aircraft maintenance (fixed wing) mechanics inspect, maintain, test and repair aircraft airframes and airframe components, hydraulic/pneumatic and structure systems, safety equipment and systems power plants and power plant systems and perform duties relating to flight line operations.",
    "moc_key": "62xx",
    "moc_code": "62XX",
    "moc_title": "Aircraft Maintenance (Fixed-Wing)",
    "moc_full_title": "62XX - Aircraft Maintenance (Fixed-Wing)",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6493",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Avionics/Maintenance Technician, Unmanned Aircraft System (UAS) install, remove, inspect, test, maintain and repair systems components, and ancillary equipment.  These Marines also perform launch recovery and other flight line operations at the organizational maintenance level.\n",
    "moc_key": "6314",
    "moc_code": "6314",
    "moc_title": "Avionics/Maintenance Technician, Unmanned Aircraft System (UAS)",
    "moc_full_title": "6314 - Avionics/Maintenance Technician, Unmanned Aircraft System (UAS)",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6494",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Communications/Navigation Systems Technicians, KC-130 install, remove, inspect, test, maintain and repair systems components, and ancillary equipment of installed aircraft communications/navigation systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6316",
    "moc_code": "6316",
    "moc_title": "Aircraft Communications/Navigation Systems Technician, KC-130",
    "moc_full_title": "6316 - Aircraft Communications/Navigation Systems Technician, KC-130",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6495",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Communications/Navigation/Radar Systems Technicians, F/A-18 install, remove, inspect, test, maintain and repair systems components, and ancillary equipment of installed aircraft communications/ navigation/radar systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6317",
    "moc_code": "6317",
    "moc_title": "Aircraft Communications/Navigation/Radar Systems Technician, F/A-18",
    "moc_full_title": "6317 - Aircraft Communications/Navigation/Radar Systems Technician, F/A-18",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6572",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Avionics Technicians, CH-53 install, remove, inspect, test, maintain and repair systems components, and ancillary equipment of installed aircraft communications/navigation/electrical systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6323",
    "moc_code": "6323",
    "moc_title": "Aircraft Avionics Technician, CH-53",
    "moc_full_title": "6323 - Aircraft Avionics Technician, CH-53",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6573",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Avionics Technicians, U/AH-1 install, remove, inspect, test, maintain and repair systems components, and ancillary equipment of installed aircraft communications/navigation/electrical systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6324",
    "moc_code": "6324",
    "moc_title": "Aircraft Avionics Technician, U/AH-1",
    "moc_full_title": "6324 - Aircraft Avionics Technician, U/AH-1",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6574",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Avionics Technicians, V-22 install, remove, inspect, test, maintain and repair systems components, and ancillary equipment of installed aircraft communications/navigation/electrical systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6326",
    "moc_code": "6326",
    "moc_title": "Aircraft Avionics Technician, V-22",
    "moc_full_title": "6326 - Aircraft Avionics Technician, V-22",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6575",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Avionics Technicians, AV-8B, install, remove, inspect, test, maintain, and repair systems, components, and ancillary equipment of installed Aircraft Communications/Navigation/Radar/Electrical Systems to include Deceptive Electronic Countermeasures (DECM) Systems at the OMA level.\n",
    "moc_key": "6332",
    "moc_code": "6332",
    "moc_title": "Aircraft Avionics Technician, AV-8B",
    "moc_full_title": "6332 - Aircraft Avionics Technician, AV-8B",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6577",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Electrical Systems Technicians, KC-130, install, remove, inspect, test, maintain, and repair system, component, and ancillary equipment of installed aircraft electrical systems at the OMA level.\n",
    "moc_key": "6336",
    "moc_code": "6336",
    "moc_title": "Aircraft Electrical Systems Technician, KC-130",
    "moc_full_title": "6336 - Aircraft Electrical Systems Technician, KC-130",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6578",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Electrical Systems Technicians, F/A-18, install, remove, inspect, test, maintain, and repair system, component, and ancillary equipment of installed aircraft electrical systems at the OMA level.\n",
    "moc_key": "6337",
    "moc_code": "6337",
    "moc_title": "Aircraft Electrical Systems Technician, F/A-18",
    "moc_full_title": "6337 - Aircraft Electrical Systems Technician, F/A-18",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6497",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Avionics Technicians, F-35, install, remove, inspect, test, maintain, and repair systems, components, and ancillary equipment of installed aircraft communications/navigation/radar/electrical systems to include deceptive electronic countermeasures (DECM) systems at the OMA level.\n",
    "moc_key": "6338",
    "moc_code": "6338",
    "moc_title": "Aircraft Avionics Technician, F-35",
    "moc_full_title": "6338 - Aircraft Avionics Technician, F-35",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6500",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Avionics Chiefs, as staff noncommissioned officers in charge of the avionics department supervise the maintenance and repair of aircraft avionics systems, equipment and components at the IMA/OMA levels. At the intermediate maintenance activity (MALS), the Avionics Chief (MGySgt) serves as the OccFld sponsor for all 63/6400 MOS within the MAG. At the organizational maintenance activity, the Avionics Chief holds the responsibility of managing the tier III EKMS account/assets as well as manages avionics manpower within the unit.\n",
    "moc_key": "6391",
    "moc_code": "6391",
    "moc_title": "Avionics Chief",
    "moc_full_title": "6391 - Avionics Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6501",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Electronic Micro/Miniature Component and Cable Repair Technicians, at the IMA level, inspect, test, maintain, and repair modules, cards, printed-circuit boards, cables, and miniature and micro-miniature components. They also perform appropriate level of corrosion control.\n",
    "moc_key": "6423",
    "moc_code": "6423",
    "moc_title": "Aviation Electronic Micro/miniature Component and Cable Repair Technician, IMA",
    "moc_full_title": "6423 - Aviation Electronic Micro/miniature Component and Cable Repair Technician, IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6502",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Electrical/Instrument/Flight Control Systems Technicians, at the IMA level, inspect, test, maintain, and repair components, assemblies, subassemblies, modules, cards, printed circuit boards, and ancillary equipment whose aggregate constitutes a complete aircraft electrical/ flight control system or subsystem.\n",
    "moc_key": "6432",
    "moc_code": "6432",
    "moc_title": "Aircraft Electrical/Instrument/Flight Control Systems Technician, IMA",
    "moc_full_title": "6432 - Aircraft Electrical/Instrument/Flight Control Systems Technician, IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6503",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Reconfigurable Transportable Consolidated Automated Support System (RTCASS) Technicians, at the IMA, inspect, test, maintain, repair, and analyze airborne weapon replaceable assemblies, shop replaceable assemblies, automatic test equipment, and ancillary equipment failures, beyond normal fault isolation procedures.\n",
    "moc_key": "6469",
    "moc_code": "6469",
    "moc_title": "Reconfigurable Transportable Consolidated Automated Support System (RTCASS) Technician, IMA",
    "moc_full_title": "6469 - Reconfigurable Transportable Consolidated Automated Support System (RTCASS) Technician, IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6504",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aircraft Electronic Communication/Navigation/ Cryptographic/Countermeasures System Technicians, at the IMA inspect, test, maintain, and repair airborne weapon replaceable assemblies, shop replaceable assemblies and ancillary equipment whose aggregate constitutes a complete Aircraft Communications, Navigation, Cryptographic, Countermeasures System or subsystem beyond normal fault isolation procedures.\n",
    "moc_key": "6483",
    "moc_code": "6483",
    "moc_title": "Communication/Navigation/Cryptographic/Countermeasures Systems Technician, IMA",
    "moc_full_title": "6483 - Communication/Navigation/Cryptographic/Countermeasures Systems Technician, IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6505",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Precision Measurement Equipment (PME) Calibration/Repair Technicians test, maintain, calibrate and repair aviation precision measurement and automatic test equipment.\n",
    "moc_key": "6492",
    "moc_code": "6492",
    "moc_title": "Aviation Precision Measurement Equipment (PME) Calibration/Repair Technician, IMA",
    "moc_full_title": "6492 - Aviation Precision Measurement Equipment (PME) Calibration/Repair Technician, IMA",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6506",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Mobile Facility Technicians inspect, service, maintain and repair mobile facilities and associated environmental control units, generators, and all other electrical and ancillary equipment.\n",
    "moc_key": "6499",
    "moc_code": "6499",
    "moc_title": "Mobile Facility Technician",
    "moc_full_title": "6499 - Mobile Facility Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6507",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "This MOS encompasses duties incident to the inspection, maintenance and repair of armament equipment and loading of aviation ordnance on Marine Corps aircraft.  The Aircraft Ordnance Technician performs a variety of duties and tasks such as inspecting ammunition, testing aircraft systems, performing preventive maintenance and effecting repairs, loading and fusing ammunition and arming/de-arming aircraft.\n",
    "moc_key": "6531",
    "moc_code": "6531",
    "moc_title": "Aircraft Ordnance Technician",
    "moc_full_title": "6531 - Aircraft Ordnance Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6508",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Ordnance Systems Technicians perform duties incident to the accounting, stowage, breakout, testing, maintenance, assembly, and transportation of aircraft armament systems, munitions handling equipment, air launched missiles, and conventional munitions. At the IMA level, Aviation Ordnance System Technicians perform required inspections, tests, checks, adjustments, preventive maintenance, and repair on armament weapons support equipment (AWSE), missile launching equipment, multiple ejection/triple ejection bomb racks, aircraft guns, turrets, aircraft crew-served weapons, aerial targets, and a wide variety of highly technical aircraft armament weapon systems in addition to performing quality assurance, safety, and maintenance management duties.\n",
    "moc_key": "6541",
    "moc_code": "6541",
    "moc_title": "Aviation Ordnance Systems Technician",
    "moc_full_title": "6541 - Aviation Ordnance Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6509",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Aviation Ordnance Chief supervises the establishment and functions of aviation ordnance activities.  The Aviation Ordnance Chief assists the Aviation Ordnance Officer with the daily planning, conduct, and execution of the ordnance section, division, or department.  They also serve as Staff Action Officers at the MARFOR, MEF, Wing, and HQMC levels, as well as select Naval and Joint Aviation Logistics/Acquisition Billets.\n",
    "moc_key": "6591",
    "moc_code": "6591",
    "moc_title": "Aviation Ordnance Chief",
    "moc_full_title": "6591 - Aviation Ordnance Chief",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6512",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Aviation Supply Specialists are required to perform those functions unique to aviation necessary to provide logistical support to naval aviation activities. Aviation Supply Specialist prime objective is to satisfy customer requirements. They perform all functions related to aviation logistics, to include customer service support, requisitioning procedures, financial management, inventory management, materiel management, facilities and storage management, and personnel staffing. In addition, Aviation Supply Specialists must have thorough knowledge of all applicable naval supply documents, forms, and publications applicable to billet assignment; and must be able to gain proficiency working with navy supply afloat procedures, to include the support of deployed aviation operations in a disaggregated operations environment. Duties include validation of customer requirements, processing requisitions, submitting requisitions, initiating appropriate follow-up actions, and processing and delivering material in accordance with all governing policies, regulations and procedures. In addition, Aviation Supply Specialists have an understanding of acquisition procedures, provisioning and requirements determination, material handling procedures, and fiscal accounting and purchasing procedures in accordance with federal acquisition regulations.\n",
    "moc_key": "6672",
    "moc_code": "6672",
    "moc_title": "Aviation Supply Specialist",
    "moc_full_title": "6672 - Aviation Supply Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6513",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The responsibilities of an ALIMS Specialist encompass a broad spectrum of network infrastructure and information systems installation, operation, administration, maintenance, and security in support of Marine Corps and Naval Aviation.  ALIMS Specialists are directly responsible for the deployment of tactical local area networks (LANs) to any theater of operation, whether in garrison, shipboard, or in forward-deployed joint-service environments.  Tactical LANs include hardware, software, and organic system administration resources that enable network connectivity, communication, operation, and management of Aviation Information Systems (AIS).  In support of a diverse portfolio of program of record AIS, ALIMS Specialists manage an array of computer and network operating systems (OS) including VMWare ESXi, Red Hat Enterprise Linux, Microsoft Windows Server, Docker, Cisco IOS, and Alcatel AOS.  ALIMS Specialists are responsible for the maintenance, repair, and secure operation of all AIS organic to the Marine Aircraft Group.  These AIS include but are not limited to:  ALIS: autonomic logistics information system; CAMEO: collaborative automated maintenance environment optimized; DTADS: data transfer and diagnostics system; EPUK: expeditionary pack-up kit; FAME: F/A-18 automated maintenance environment; IBSONE: integrated barcode system; IMDS: integrated mechanical diagnostics system; MPE: mission planning environment systems; NFSA: NAVAIR fleet system array; NTCSS: naval tactical command support system; ODIN: operational data integrated network; OOMA: optimized organizational maintenance activity; and PEMA: portable electronic maintenance aids.  Administrative tasks for the ALIMS Specialist include but are not restricted to acting as the primary point of contact for all Aviation Logistics IT-related issues, ensuring AIS confidentiality, integrity, and availability, as well as providing continuity of operations through high-availability and disaster recovery procedures.  Marines in the MOS may be assigned to a BIC within their occupational field that has been coded with one or more DoD Cyber Workforce Framework work role codes. Reference DoDI 8140.10, DoDM 8140.10, and the MOS roadmap for additional training and certification requirements associated with work role codes.\n",
    "moc_key": "6694",
    "moc_code": "6694",
    "moc_title": "Aviation Logistics Information Management System (ALIMS) Specialist",
    "moc_full_title": "6694 - Aviation Logistics Information Management System (ALIMS) Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6514",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Typical duties of the METOC Analyst Forecaster include observing, collecting, recording, validating, processing, disseminating, and assimilation of METOC data and information to formulate forecasts and environmental assessments.  METOC Analyst Forecasters use and perform preventive maintenance on METOC sensors, information technology systems, and equipment.\n",
    "moc_key": "6842",
    "moc_code": "6842",
    "moc_title": "METOC Analyst Forecaster",
    "moc_full_title": "6842 - METOC Analyst Forecaster",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6516",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "An EAF Systems Technician provides the marine air ground task force (MAGTF) the capability to rapidly deploy and establish survivable, self-sustaining airfields in support of a wide range of military and humanitarian operations. Marines in this occupational field operate, inspect, and maintain emergency arresting gear systems for high performance marine corps, navy, air force, and north atlantic treaty organization (NATO) tail hook aircraft. These specially trained technicians are responsible for the design of expeditionary AM-2 airfields employed for military operations and humanitarian aid. Marines of the 7011 occupational specialty, also provide expeditionary lighting systems for marine expeditionary units (MEUs) and conduct tactical/assault landing zone surveys for naval and marine corps tactical aircraft.\n",
    "moc_key": "7011",
    "moc_code": "7011",
    "moc_title": "Expeditionary Airfield Systems Technician",
    "moc_full_title": "7011 - Expeditionary Airfield Systems Technician",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6517",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "To provide the Marine Corps with trained personnel in MOS 7041, Aviation Operations Specialist (AOS). Selected marine corps personnel, male and female are provided with the basic duties of an Aviation Operations Specialist. This includes drafting correspondence; assisting in the preparation of orders, maintaining orders of flight time in both master and individual flight files in accordance with current marine corps standard systems and software applications; maintaining files of extended flight; storage and dissemination of flight information publications (FLIP); posting radio and landing facility charts, flight information manuals, maps, and preparing aviation operations safety reports. Additional duties include supporting air tasking order (ATO) production within a tactical air command (TACC), coordinating airfield services to include air traffic control (ATC), meteorological and oceanographic (METOC) services, aircraft rescue and firefighting (ARFF) transient aircraft, flight planning, fuel services, airfield maintenance in accordance with federal aviation administration (FAA) guidelines and restricted airspace management for tenant and non-tenant activities. Although this training is not all inclusive, graduates will be able to function at all levels of command. MOS 7041 is assigned upon completion of the Marine Aviation Operations Specialist Course (MARAOS) and meeting all required prerequisites.\n",
    "moc_key": "7041",
    "moc_code": "7041",
    "moc_title": "Aviation Operations Specialist",
    "moc_full_title": "7041 - Aviation Operations Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6518",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "EFR is a unique capability within the ACE. EFR provides aircraft rescue and firefighting services in support of airfield operations (AirOps) at forward locations and support installations. EFR services include incident command, fire suppression and extinguishment, extrication and rescue, basic emergency medical services, salvage and overhaul operations, and immediate hazardous material operations level response. While supporting a forward location, the EFR platoon is also responsible for the effective implementation and management of fire protection and prevention programs and aircraft salvage and recovery operations.\n",
    "moc_key": "7051",
    "moc_code": "7051",
    "moc_title": "Expeditionary Firefighting and Rescue (EFR) Specialist",
    "moc_full_title": "7051 - Expeditionary Firefighting and Rescue (EFR) Specialist",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6519",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "LAAD Gunners serve in ground-based air defense (GBAD) units with the mission to provide surface-to-air fires in support of MAGTF critical assets from threat unmanned aerial systems, missiles, and fixed and rotary wing aircraft. Gunners are responsible for employment and maintenance of all equipment and weapon systems inherent to a LAAD Battalion. Gunners will provide air base ground security when not engaged in air defense operations.\n",
    "moc_key": "7212",
    "moc_code": "7212",
    "moc_title": "Low Altitude Air Defense (LAAD) Gunner",
    "moc_full_title": "7212 - Low Altitude Air Defense (LAAD) Gunner",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6520",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Tactical Air Defense Controllers advise on effective use of battle management assets. They provide functional expertise and input for activating, employing, deploying, or deactivating battle management systems. ACO manage assigned forces and air operations using voice and data communications and radar systems. Tactical Air Defense Controllers advise on weapons control capabilities. To facilitate MAGTF operations, Tactical Air Defense Controllers conduct analysis to determine optimum emplacement of AC2 ground units, surface-to-air platforms, and positioning of airborne assets. ACO’s provide appropriate types of positive and procedural control or direction of friendly aircraft in combat airspace. Tactical Air Defense Controllers direct aircraft in the execution of the six functions of marine aviation. Tactical Air Defense Controllers coordinate and integrate kinetic and non-kinetic aviation fires into combat airspace. This includes control of defensive counter air (DCA), offensive counter Air (OCA), and armed interdiction (AI) flights. They also coordinate and direct close air support (CAS), deep air support (DAS), assault support (AS), medical evacuation (MEDEVAC), casualty evacuation (CASEVAC), electronic warfare (EW), aerial reconnaissance (AR), and aerial refueling missions. During amphibious operations, air control operators can also be selectively employed in the navy tactical air control center (TACC Afloat), supporting arms coordination center (SACC), and landing force operations center (LFOC).\n",
    "moc_key": "7236",
    "moc_code": "7236",
    "moc_title": "Tactical Air Defense Controller",
    "moc_full_title": "7236 - Tactical Air Defense Controller",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6521",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Support Operations Operators perform duties that support the integration of aviation with the ground combat element (GCE). They are responsible for processing immediate requests for close air support, casualty evacuation (CASEVAC) and medical evacuation (MEDEVAC), and assault support, integrating aviation with other supporting arms and ensuring safety of flight for aircraft throughout the MAGTF area of operations. Their efforts support the management of combat airspace and the delivery of kinetic and non-kinetic aviation fires in support of ground forces. They also coordinate air missions that require deep air support (DAS), electronic warfare (EW), aerial refueling and designated air reconnaissance (AR). They are also responsible for the preparation, movement, emplacement and operation of air support equipment and tactical data systems. During operations they normally work in the direct air support center (DASC) which is co-located with the GCE or the tactical air command center (TACC) which is the operational command post for the ACE. During amphibious operations Air support operations operators can also be employed in the navy tactical air control center (TACC Afloat), supporting arms coordination center (SACC), and landing force operations center (LFOC) as required.\n",
    "moc_key": "7242",
    "moc_code": "7242",
    "moc_title": "Air Support Operations Operator",
    "moc_full_title": "7242 - Air Support Operations Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6561",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Air Traffic Controllers routinely perform various duties and tasks related to the control of air traffic and vehicles within the designated areas aboard an established airport control zone, expeditionary airfield, or remote area landing site. These duties are performed within control towers, radar facilities, and expeditionary air traffic control equipment. The Military Airspace Management Course (F0273D1); MAJIC Course (A05L6Z1); Introduction to US Air Force Flight Procedures (F35YLH1); JAOC2C Course (F19L2W2); and other courses listed in the ATC Training and Readiness Manual, are available to 7257’s for skill enhancement training.\n",
    "moc_key": "7257",
    "moc_code": "7257",
    "moc_title": "Air Traffic Controller",
    "moc_full_title": "7257 - Air Traffic Controller",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6526",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "As a GySgt, the Senior Air Traffic Controller performs Air Traffic Control Branch Chief duties, including Tower Chief, Radar Chief, or Training Chief.  They are responsible to the Air Traffic Control Officer-in-charge for the management of air traffic control functions in their branch, credentialing of Air Traffic Controllers, and application of Federal Aviation Administration Regulations, NATOPS, and standard operating procedures to deployed air traffic control detachments and Marine Corps air stations.  As a MSgt-MGySgt, the Senior Air Traffic Controller additionally assists and advises the Air Traffic Control Detachment Commander, Marine Air Control Squadron (MACS) Operations Officer, or the Air Traffic Control Facility Officer for operational planning and personnel management.  They advise and make recommendations for the planning, coordination, and execution of the unit’s TEEP. They assist with the timely collection, review, and distribution of messages, briefs, reports, training schedules and all tasks in support of the unit’s core and assigned Mission Essential Tasks.\n",
    "moc_key": "7291",
    "moc_code": "7291",
    "moc_title": "Senior Air Traffic Controller",
    "moc_full_title": "7291 - Senior Air Traffic Controller",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6528",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "MQ-9 Reaper Unmanned Aircraft System (UAS) Sensor Operators (SO) conduct multi-imagery sensor reconnaissance (MIR) and surveillance of potential targets and areas of interest. The Sensor Operator detects, analyzes and discriminates between valid and invalid targets using synthetic aperture radar (SAR), electro-optical, low-light, and infrared full-motion video imagery, and other active or passive acquisition and tracking systems. Sensor Operators assist the pilot in air navigation, flight planning, and other crew coordination tasks to achieve overall mission objectives. The Sensor Operator utilizes laser target marking systems to provide target identification and illumination, in support of other combat assets.\n",
    "moc_key": "7314",
    "moc_code": "7314",
    "moc_title": "Sensor Operator (SO), MQ-9",
    "moc_full_title": "7314 - Sensor Operator (SO), MQ-9",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6529",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The SUAS Operator is responsible for the planning, coordinating, integrating and safe operations of the SUAS in support of company and battalion missions. As a SUAS operator, you will maintain and remotely pilot small-unmanned air vehicles, manage the use of onboard optics, synchronize SUAS into unit operations, and serve as the subject matter expert (SME) in SUAS operations and capabilities for the company and battalion.\n",
    "moc_key": "7316",
    "moc_code": "7316",
    "moc_title": "Small Unmanned Aircraft System (SUAS) Operator",
    "moc_full_title": "7316 - Small Unmanned Aircraft System (SUAS) Operator",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6580",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "Career Recruiters are superior recruiters who will serve to establish a cadre of professional recruiters with long-term assignments in key managerial billets to improve the management and effectiveness of the recruiting effort. These billets include Staff Noncommissioned Officer in charge, instructor, Operations Chief, training team member, and liaison billets. Gunnery Sergeants serving as Career Recruiters may be considered for promotion to Master Sergeant and First Sergeant. Career Recruiters can anticipate a minimum 3-year tour in assigned key recruiting billets and should anticipate transfer to another key billet upon the completion of a 3-year tour. Assignment of Career Recruiters is determined by the needs of Marine Corps Recruiting Command and the personal desires of the individual concerned.\n",
    "moc_key": "8412",
    "moc_code": "8412",
    "moc_title": "Career Recruiter",
    "moc_full_title": "8412 - Career Recruiter",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "8978",
    "moc_codetype": "MOS",
    "moc_secondary_id": "",
    "moc_secondary_text": "",
    "moc_secondary_code": "",
    "moc_description": "Career Prior Service Recruiters are superior production recruiters and serve to establish a cadre of professional prior service recruiters with long-term assignments in key managerial billets to improve the management and effectiveness of the recruiting effort. These billets include staff noncommissioned officer-in-charge, operations chief, recruiter instructor, recruiter school instructor, and assistant recruiter instructor. Assignment of Career Prior Service Recruiters is determined by the needs of the recruiting service and the personal desires of the individual concerned.\n",
    "moc_key": "8422",
    "moc_code": "8422",
    "moc_title": "Career Prior Service Recruiter",
    "moc_full_title": "8422 - Career Prior Service Recruiter",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  },
  {
    "moc_id": "6593",
    "moc_codetype": "MOS",
    "moc_secondary_id": "23",
    "moc_secondary_text": "Primary MOS (Marines)",
    "moc_secondary_code": "PMOS",
    "moc_description": "The Command Senior Enlisted Leader is responsible to the commander for all matters which effect the morale, welfare, discipline, mission success, and overall readiness of the unit.  They disseminate and enforce Marine Corps and local policies, orders, and directives.  They possess comprehensive knowledge of Marine Corps organization, history, traditions, customs and courtesies. They are directly responsible for all enlisted career human resource matters within the unit and have a mandate to maintain and develop the total force.\n",
    "moc_key": "8999",
    "moc_code": "8999",
    "moc_title": "Sergeant Major-First Sergeant",
    "moc_full_title": "8999 - Sergeant Major-First Sergeant",
    "moc_personnelcategory": "E",
    "moc_complete": "1",
    "moc_group": ""
  }
]
