{
  "id": 1,
  "title": "Core Fundamentals",
  "thumbnail": {
    "src": "https://res.cloudinary.com/vetswhocode/image/upload/f_auto,q_auto/v1734314663/core-fundamentals.png"
  },
  "published_at": "2020-12-01T00:00:00.000Z",
  "category": "programming",
  "price": null,
  "currency": null,
  "language": "english",
  "instructor": 1,
  "duration": null,
  "total_lectures": null,
  "total_students": null,
  "membership": [],
  "excerpt": "Unlock the building blocks of modern development with the Core Fundamentals section by Vets Who Code. Covering Command Line, Bash Scripting, Git, GitHub, Markdown, and Visual Studio Code, this section is the perfect introduction to foundational skills every developer must master. Gain confidence in managing projects, automating workflows, collaborating on code, and documenting your work with clarity and precision.",
  "curriculum": ["chapter-01", "chapter-02", "chapter-03", "chapter-04", "chapter-05"],
  "reviews": {
    "average": null,
    "count": 0,
    "rating_details": {
      "5": 0,
      "4": 0,
      "3": 0,
      "2": 0,
      "1": 0
    },
    "items": []
  },
  "description": [
    {
      "id": 1,
      "type": "iframe",
      "content": {
        "src": "https://res.cloudinary.com/vetswhocode/video/upload/f_auto,q_auto/v1707063739/command-line_virgir.mp4",
        "alt": "Command Line Interface Video"
      }
    },
    {
      "id": 2,
      "type": "text",
      "content": "The Core Fundamentals section by Vets Who Code is designed to equip you with the essential tools and workflows that underpin the modern developer's toolkit. This section is perfect for beginners looking to establish a strong foundation and for experienced users seeking to refresh their skills in Command Line, Bash Scripting, Git, GitHub, Markdown, and Visual Studio Code."
    },
    {
      "id": 3,
      "type": "text",
      "content": "Learn to navigate and interact with your computer like a pro using the Command Line Interface (CLI). The CLI offers unparalleled speed and efficiency compared to graphical user interfaces, empowering you to execute commands, manage files, and customize workflows effortlessly. By mastering the CLI, you'll gain the ability to perform powerful system operations, troubleshoot issues, and automate repetitive tasks with precision."
    },
    {
      "id": 4,
      "type": "text",
      "content": "Bash scripting takes your command-line skills to the next level by introducing automation and scripting capabilities. Learn how to write scripts that automate tedious tasks, such as file backups, log analysis, and repetitive system management. This skill is invaluable for increasing productivity and enhancing your understanding of how computers process instructions."
    },
    {
      "id": 5,
      "type": "text",
      "content": "Git is the industry-standard tool for version control and collaborative development. In this section, you'll learn how to initialize repositories, commit changes, create branches, and merge code. Mastering Git ensures you can effectively manage project history, collaborate with teams, and resolve code conflicts with ease."
    },
    {
      "id": 6,
      "type": "text",
      "content": "Building on your Git skills, you'll explore GitHub, the most popular platform for hosting and sharing repositories. Learn how to push your code to GitHub, manage pull requests, and collaborate with teams on open-source and professional projects. GitHub not only serves as a version control system but also as a portfolio to showcase your work to potential employers."
    },
    {
      "id": 7,
      "type": "text",
      "content": "Markdown is a lightweight and versatile markup language used to create professional documentation, README files, and wikis. With Markdown, you can format text, include links, add images, and structure content with ease. This skill is essential for clearly communicating your ideas and project details to collaborators and stakeholders."
    },
    {
      "id": 8,
      "type": "text",
      "content": "Visual Studio Code (VS Code) is one of the most powerful and widely-used code editors. In this section, you'll learn how to set up and customize VS Code for maximum productivity. Discover essential extensions, keyboard shortcuts, and features like debugging, Git integration, and terminal usage—all within a single tool. By mastering VS Code, you'll streamline your workflow and write clean, efficient code more effectively."
    },
    {
      "id": 9,
      "type": "text",
      "content": "The tools and workflows covered in this section are indispensable for any developer. Whether you're a beginner or looking to sharpen your technical skills, this section provides the foundation to thrive in software development. You'll gain the confidence to navigate technical environments, automate tasks, manage projects, and collaborate effectively with teams."
    },
    {
      "id": 10,
      "type": "text",
      "content": "By the end of this section, you'll not only understand these critical tools but also be able to apply them in real-world scenarios. Unlock your potential and accelerate your journey as a developer. Start building a strong foundation for your career in tech with Vets Who Code!"
    }
  ]
}