{
  "id": 9,
  "title": "DevOps",
  "thumbnail": {
    "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314664/9_mq1juj.png"
  },
  "published_at": "2020-12-01T00:00:00.000Z",
  "category": "programming",
  "price": null,
  "currency": null,
  "language": "english",
  "instructor": 1,
  "duration": null,
  "total_lectures": null,
  "total_students": null,
  "membership": [],
  "excerpt": "Learn the essentials of DevOps with this section by Vets Who Code. Master the practices and tools that bridge the gap between development and operations, enabling efficient workflows, automated deployments, and scalable applications.",
  "curriculum": ["chapter-01", "chapter-02", "chapter-03", "chapter-04", "chapter-05"],
  "reviews": {
    "average": null,
    "count": 0,
    "rating_details": {
      "5": 0,
      "4": 0,
      "3": 0,
      "2": 0,
      "1": 0
    },
    "items": []
  },
  "description": [
    {
      "id": 1,
      "type": "iframe",
      "content": {
        "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314664/9_mq1juj.png",
        "alt": "DevOps Introduction Video"
      }
    },
    {
      "id": 2,
      "type": "text",
      "content": "The DevOps section by Vets Who Code provides a comprehensive introduction to the principles and practices of modern software delivery. Learn how to streamline collaboration between development and operations teams to create faster, more reliable software releases."
    },
    {
      "id": 3,
      "type": "text",
      "content": "Understand the <b>DevOps lifecycle</b>: from planning and coding to building, testing, releasing, deploying, operating, and monitoring. Gain insights into how continuous integration and continuous delivery (CI/CD) form the backbone of DevOps workflows."
    },
    {
      "id": 4,
      "type": "text",
      "content": "Learn to use popular <b>DevOps tools</b>, including GitHub Actions for CI/CD pipelines, Docker for containerization, and Kubernetes for orchestration. Get hands-on experience with automating deployments and managing infrastructure as code."
    },
    {
      "id": 5,
      "type": "text",
      "content": "Discover the importance of <b>infrastructure as code (IaC)</b> using tools like Terraform and Ansible. Learn how to define, provision, and manage infrastructure in a repeatable and version-controlled manner."
    },
    {
      "id": 6,
      "type": "text",
      "content": "Explore the principles of <b>monitoring and logging</b> to maintain system health and detect issues proactively. Learn how to use tools like Prometheus, Grafana, and ELK Stack to visualize and analyze system performance."
    },
    {
      "id": 7,
      "type": "text",
      "content": "Understand the importance of <b>security in DevOps</b> (DevSecOps). Learn how to integrate security practices into every stage of the DevOps lifecycle, from code scanning to automated vulnerability assessments."
    },
    {
      "id": 8,
      "type": "text",
      "content": "This section also covers <b>cloud platforms</b> like AWS, Azure, and Google Cloud. Learn how to deploy and scale applications in the cloud while optimizing costs and ensuring high availability."
    },
    {
      "id": 9,
      "type": "text",
      "content": "By the end of this section, you'll have a solid understanding of DevOps practices and tools. Whether you're an aspiring DevOps engineer or a developer looking to enhance your workflows, this section will prepare you to excel in modern software delivery."
    }
  ]
}