{
  "id": 5,
  "title": "Postgres Databases with Neon",
  "thumbnail": {
    "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314663/postgres-databases-with-neon.png"
  },
  "published_at": "2020-12-01T00:00:00.000Z",
  "category": "programming",
  "price": null,
  "currency": null,
  "language": "english",
  "instructor": 1,
  "duration": null,
  "total_lectures": null,
  "total_students": null,
  "membership": [],
  "excerpt": "Learn to manage and scale Postgres databases with Neon in this section by Vets Who Code. Master the fundamentals of database design, querying, and optimization using a cloud-native platform built for modern development workflows.",
  "curriculum": ["chapter-01", "chapter-02", "chapter-03", "chapter-04", "chapter-05"],
  "reviews": {
    "average": null,
    "count": 0,
    "rating_details": {
      "5": 0,
      "4": 0,
      "3": 0,
      "2": 0,
      "1": 0
    },
    "items": []
  },
  "description": [
    {
      "id": 1,
      "type": "iframe",
      "content": {
        "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314663/postgres-databases-with-neon.png",
        "alt": "Postgres Databases with Neon Video"
      }
    },
    {
      "id": 2,
      "type": "text",
      "content": "The Postgres Databases with Neon section by Vets Who Code introduces developers to the robust features of PostgreSQL, one of the most powerful relational database systems, paired with Neon's modern cloud-native database platform. This section is perfect for those who want to master database management and leverage scalable database solutions."
    },
    {
      "id": 3,
      "type": "text",
      "content": "Learn the fundamentals of **PostgreSQL**, including how to create and manage databases, tables, and relationships. Understand the principles of relational database design, normalization, and indexing to optimize performance and data integrity."
    },
    {
      "id": 4,
      "type": "text",
      "content": "Explore **Neon's unique features**, such as serverless scaling and branching, which allow you to create isolated environments for development and testing without affecting production data. Neon’s flexible architecture is built for modern workflows and cloud-native applications."
    },
    {
      "id": 5,
      "type": "text",
      "content": "Master **SQL querying**: Learn to write powerful queries to retrieve, filter, and manipulate data. Gain hands-on experience with SELECT statements, JOINs, aggregate functions, and subqueries to extract meaningful insights from your data."
    },
    {
      "id": 6,
      "type": "text",
      "content": "Understand **data migrations** and how to manage schema changes effectively using tools like Flyway or Liquibase. Learn best practices for versioning your database schema alongside your application code."
    },
    {
      "id": 7,
      "type": "text",
      "content": "Dive into **performance optimization techniques**: Learn how to analyze query performance with EXPLAIN, create efficient indexes, and understand caching strategies to ensure your database scales efficiently."
    },
    {
      "id": 8,
      "type": "text",
      "content": "Learn how to secure your database with **user roles**, permissions, and encrypted connections. Understand how to protect sensitive data and comply with security best practices in your database design."
    },
    {
      "id": 9,
      "type": "text",
      "content": "By the end of this section, you’ll have the skills to design, query, and manage PostgreSQL databases on the Neon platform. Whether you’re building small projects or large-scale applications, this section provides the knowledge you need to create efficient and scalable database solutions."
    }
  ]
}