{
  "id": 2,
  "title": "Software Engineering",
  "thumbnail": {
    "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771981421/software-engineering_yubnh2.png"
  },
  "published_at": "2020-12-02T00:00:00.000Z",
  "category": "programming",
  "price": null,
  "currency": null,
  "language": "english",
  "instructor": 1,
  "duration": "5 weeks",
  "total_lectures": 5,
  "total_students": null,
  "membership": [],
  "excerpt": "Build full-stack applications with modern frameworks and ship them to production. This phase takes you from writing code to engineering software — architecture, testing, deployment, and the interview skills to get paid for it.",
  "curriculum": [
    "advanced-javascript-typescript",
    "nextjs-full-stack",
    "testing-and-qa",
    "cicd-and-deployment",
    "technical-interviews"
  ],
  "reviews": {
    "average": null,
    "count": 0,
    "rating_details": {
      "5": 0,
      "4": 0,
      "3": 0,
      "2": 0,
      "1": 0
    },
    "items": []
  },
  "description": [
    {
      "id": 1,
      "type": "image",
      "content": {
        "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771981421/software-engineering_yubnh2.png",
        "alt": "Software Engineering Phase Introduction"
      }
    },
    {
      "id": 2,
      "type": "text",
      "content": "Weeks 5–9 · 5 Modules. Build full-stack applications with modern frameworks and ship them to production. This phase takes you from writing code to engineering software — architecture, testing, deployment, and the interview skills to get paid for it."
    },
    {
      "id": 3,
      "type": "text",
      "content": "Module 9: Advanced JavaScript & TypeScript — Level up from JavaScript basics to the type-safe, scalable patterns used in production codebases. Covers TypeScript fundamentals and type system, interfaces, generics and utility types, closures, prototypes and advanced patterns, module systems and build tools, and advanced async patterns."
    },
    {
      "id": 4,
      "type": "text",
      "content": "Module 10: Next.js Full-Stack — Build complete applications with the framework powering the modern web. Covers App Router, pages, layouts and routing, Server Components and Client Components, API routes and server actions, data fetching, caching and state management, and authentication, middleware and database integration."
    },
    {
      "id": 5,
      "type": "text",
      "content": "Module 11: Testing & QA — Ship with confidence. If it's not tested, it doesn't work. Covers unit testing fundamentals, integration and end-to-end testing, test-driven development (TDD), mocking, fixtures and test strategy, and code coverage and quality metrics."
    },
    {
      "id": 6,
      "type": "text",
      "content": "Module 12: CI/CD & Deployment — Automate everything between your code and your users. Covers CI/CD pipeline design and implementation, GitHub Actions workflows, environment management (dev, staging, production), containerization basics, and cloud deployment and hosting."
    },
    {
      "id": 7,
      "type": "text",
      "content": "Module 13: Technical Interviews — Practice doesn't make perfect — deliberate practice does. Covers system design fundamentals, behavioral interview preparation (STAR method), live coding practice and communication, take-home project strategy, and salary negotiation and offer evaluation."
    },
    {
      "id": 8,
      "type": "text",
      "content": "Phase Outcome: Build, test, and deploy production applications. Pass technical interviews."
    }
  ]
}
