{
  "id": 2,
  "title": "Web Fundamentals",
  "thumbnail": {
    "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314663/web-fundamentals.png"
  },
  "published_at": "2020-12-01T00:00:00.000Z",
  "category": "programming",
  "price": null,
  "currency": null,
  "language": "english",
  "instructor": 1,
  "duration": null,
  "total_lectures": null,
  "total_students": null,
  "membership": [],
  "excerpt": "Learn the building blocks of the web with the Web Fundamentals section by Vets Who Code. This section covers HTML, CSS, and JavaScript, empowering you to create stunning, responsive, and interactive websites. Whether you're just starting out or looking to solidify your web development skills, this section provides the tools and knowledge to bring your ideas to life.",
  "curriculum": ["chapter-01", "chapter-02", "chapter-03", "chapter-04", "chapter-05"],
  "reviews": {
    "average": null,
    "count": 0,
    "rating_details": {
      "5": 0,
      "4": 0,
      "3": 0,
      "2": 0,
      "1": 0
    },
    "items": []
  },
  "description": [
    {
      "id": 1,
      "type": "iframe",
      "content": {
        "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1734314663/web-fundamentals.png",
        "alt": "Web Fundamentals Introduction Video"
      }
    },
    {
      "id": 2,
      "type": "text",
      "content": "The Web Fundamentals section by Vets Who Code introduces you to the essential technologies that power the web: HTML, CSS, and JavaScript. These technologies are the foundation of every website and web application, making them critical for any aspiring developer to master."
    },
    {
      "id": 3,
      "type": "text",
      "content": "HTML (HyperText Markup Language) is the backbone of web content. Learn how to structure web pages using semantic HTML elements, create accessible content, and organize your projects effectively. From text and images to forms and tables, HTML gives you the building blocks to bring your ideas to life."
    },
    {
      "id": 4,
      "type": "text",
      "content": "CSS (Cascading Style Sheets) is what brings design to your web pages. Dive into the world of styling, layouts, and animations. Learn how to use CSS properties to create visually appealing and responsive websites. Whether it's modern grid layouts or eye-catching transitions, CSS empowers you to make your designs stand out."
    },
    {
      "id": 5,
      "type": "text",
      "content": "JavaScript is the language that brings interactivity to the web. Gain a strong foundation in JavaScript basics, including variables, loops, functions, and events. Learn how to create dynamic, interactive experiences, such as image sliders, form validations, and custom scripts to enhance user engagement."
    },
    {
      "id": 6,
      "type": "text",
      "content": "This section is perfect for beginners who are new to web development and for those who want to revisit the fundamentals. By mastering HTML, CSS, and JavaScript, you'll have the skills to create websites that are not only functional but also engaging and responsive."
    },
    {
      "id": 7,
      "type": "text",
      "content": "The Web Fundamentals section by Vets Who Code prepares you for the exciting journey of web development. Whether you're building your portfolio, creating personal projects, or stepping into a professional development role, this section provides the solid foundation you need to succeed."
    }
  ]
}