{
    "name": "about-us",
    "content": [
      {
        "section": "hero-area",
        "items": [
          {
            "id": 1,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746070172/2_zc19qj.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "Outcome-Oriented <br> Success<br>"
              },
              {
                "id": 2,
                "content": "Focus on Impactful Learning"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Tailoring Skills for the Software Industry."
              }
            ]
          },
          {
            "id": 2,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746583132/14_ogbakk.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "FULLY<br> ONLINE<br>"
              },
              {
                "id": 2,
                "content": "Learning Without Limits"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Designed for Flexibility: Learn From Anywhere, Anytime."
              }
            ]
          },
          {
            "id": 3,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746583127/12_ztvu6t.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "LEARN <br>PRAGMATICALLY<br>"
              },
              {
                "id": 2,
                "content": "Practical Coding Proficiency"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Learn To Think And Solve Problems like a Programmer."
              }
            ]
          }
        ]
      },
      {
        "section": "timeline-area",
        "section_title": {
          "title": "About<br> Us",
          "subtitle": "Our Story"
        },
        "items": [
          {
            "id": 1,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746583122/8_azjgpx.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "The Ordinary World"
              },
              {
                "id": 2,
                "content": "Where We Started"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "For years, veterans like us stepped out of uniform and into a civilian job market that spoke a language we didn't yet understand. Recruiters skimmed past our leadership stories, résumés disappeared into applicant‑tracking systems, and the gap between our disciplined experience and the tech roles we wanted felt wider than the ocean we once crossed. Established in 2014, #VetsWhoCode is a proactive non-profit bridging the gap in technical expertise, inspired by 'To Teach a Man To Fish,' we prepare transitioning veterans and military spouses for the workforce."
              }
            ]
          },
          {
            "id": 2,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746583127/10_khmgby.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "The Call to Adventure"
              },
              {
                "id": 2,
                "content": "Building Our Bridge"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Instead of settling for 'thanks for your service,' a handful of us gathered on late‑night video calls and dared to ask, What if we built our own bridge? That question became Vets Who Code—a mission to transform military grit into world‑class software engineering skill. Doubt tried to ground us. Could a free, fully remote program really move veterans into top tech jobs? We were told it was impossible without massive tuition or fancy campuses. We pushed forward anyway, fueled by stubborn optimism and the knowledge that missions rarely start with perfect resources."
              }
            ]
          },
          {
            "id": 3,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746583121/6_qi229q.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "Tests and Allies"
              },
              {
                "id": 2,
                "content": "The Journey"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Our mentors emerged from the veteran community itself: senior engineers, tech leads, and hiring managers who had already made the leap. They guided us in translating NATO phonetics into JavaScript functions, after‑action reviews into code reviews, and squad tactics into agile collaboration. Daily pair‑programming sessions, weekend hack‑a‑thons, and live code audits forged our skills. Time‑zone differences, career doubts, and imposter syndrome tried to slow us down, but our ally network grew: mentors from Microsoft, GitHub, Salesforce, JP Morgan Chase, Chewy, Apple, Google, and CBS Interactive volunteered on Slack at zero‑dark‑thirty to keep us moving."
              }
            ]
          },
          {
            "id": 4,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746590042/4_a79tb5.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "The Reward and Return"
              },
              {
                "id": 2,
                "content": "Full Circle Impact"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "Every veteran faces a crucible project—building a full‑stack application under real‑world constraints. Graduates emerge with production portfolios, lifelong allies, and offer letters that turn service stripes into six‑figure salaries. Collectively, alumni have earned more than twenty million dollars and injected veteran leadership into some of the most influential engineering teams on Earth. But the journey doesn't end at first employment. Alumni return as mentors and donors, passing on their knowledge and financially supporting those who follow. They prototype new tools—like our AI‑augmented Nonprofit‑as‑a‑Service platform and Mission UI design system—to scale impact beyond borders."
              }
            ]
          },
          {
            "id": 5,
            "images": [
              {
                "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1746590043/9_ahefah.png"
              }
            ],
            "headings": [
              {
                "id": 1,
                "content": "Return with the Elixir"
              },
              {
                "id": 2,
                "content": "Our Vision Forward"
              }
            ],
            "texts": [
              {
                "id": 1,
                "content": "A decade in, Vets Who Code has evolved into a remote‑first, AI‑enabled nonprofit that treats veterans as stakeholders, not charity cases. We blend human mentorship with machine intelligence to personalize learning and keep our Field Manual evergreen.\n\n By 2030 we will arm ten‑thousand veterans with high‑value tech skills, generate a billion dollars in lifetime earnings for alumni, and prove that nonprofits can scale like startups—powered by talent, trust, and tech. If you're a veteran staring at the civilian tech world and wondering where you fit, your call to adventure has arrived. Join us, cross the threshold, and write the next chapter of your mission in code."
              }
            ]
          }
        ]
      },
      {
        "section": "cta-area",
        "section_title": {
          "title": "Your investment today creates tomorrow's software engineers. Every dollar you contribute to #VetsWhoCode doesn't just fund training—it transforms lives, families, and communities. Veterans who complete our program see an average salary increase of 400%, turning military precision into six-figure careers. When you donate, you're not giving charity; you're fueling a proven system that has already generated over twenty million dollars in collective earnings for those who served our country. Our graduates become mentors and donors themselves, creating a self-sustaining cycle of success that multiplies your impact far beyond your initial contribution.<br></br> By 2030, with your help, we'll equip 10,000 veterans with cutting-edge tech skills, generate one billion dollars in lifetime earnings, and prove that nonprofits can scale like startups while maintaining their soul. Unlike traditional programs with high overhead, we're remote-first and tech-enabled—meaning more of your donation goes directly to veteran success. Our AI-augmented learning platform adapts to each veteran's unique background and learning style, maximizing educational outcomes while minimizing costs. Join our mission to transform military experience into tech excellence, close the digital talent gap, and help those who defended our freedom build America's innovation future. Your donation isn't just appreciated—it's leveraged, maximized, and transformed into sustainable careers that honor service through opportunity.",
          "subtitle": "How can <strong>YOU</strong> join our mission?"
        },
        "buttons": [
          {
            "id": 1,
            "path": "/donate",
            "content": "Donate"
          }
        ]
      }
    ]
  }