[
    {
        "id": 1,
        "name": "Addy Osmani",
        "slug": "addy-osmani",
        "path": "/team/addy-osmani",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1767417724/team/addy-osmani.jpg",
            "width": 350,
            "height": 430,
            "alt": "Engineering Leader, Google Chrome & Author"
        },
        "designation": "Board Member",
        "bio": "Addy Osmani is an Engineering Leader at Google, where he heads the Chrome Developer Experience team and contributes to Gemini with Google DeepMind. He is an Irish software engineer with more than 25 years of development experience and has been at Google for over thirteen years. In his role, Addy focuses on reducing friction for users and web developers, shaping the future of the web through performance, usability, and developer tools. With a background in large-scale systems, open-source projects, and web platform innovation, he brings deep technical expertise and strategic insight to his work. He is passionate about advancing the web ecosystem, empowering developers worldwide, and making technology more accessible and reliable for everyone.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/addyosmani/"
            },
            {
                "label": "GitHub",
                "icon": "fab fa-github",
                "url": "https://github.com/addyosmani"
            }
        ]
    },
    {
        "id": 2,
        "name": "Brian Holt",
        "slug": "brian-holt",
        "path": "/team/brian-holt",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1756348115/brian2022_fpbsyq.jpg",
            "width": 350,
            "height": 430,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Brian Holt is a senior product leader at Databricks and a renowned instructor at Frontend Masters, where he has taught workshops viewed for over a century of human-hours by developers worldwide. With over a decade of experience in tech, Brian has held senior product and engineering roles at companies including Stripe, Microsoft, Netflix, and Reddit, focusing on developer tools and experiences that help engineers write effective, secure, and performant code. As a college dropout who navigated his own non-traditional path into technology, Brian understands firsthand the challenges of breaking into the industry without a conventional background. Growing up as the son of a veteran, he has deep appreciation for the military community and is passionate about helping veterans translate their unique skills and discipline into successful tech careers. Through his work with Vets Who Code, Brian combines his expertise in developer education and his understanding of alternative pathways into technology to support veterans in their transition to meaningful careers in software development.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/btholt/"
            },
            {
                "label": "GitHub",
                "icon": "fab fa-github",
                "url": "https://github.com/btholt"
            }
        ]
    },
    {
        "id": 3,
        "name": "Jarrad Turner",
        "slug": "jarrad-turner",
        "path": "/team/jarrad-turner",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1756403937/jarrad-turner-headshot_upzz2v.png",
            "width": 350,
            "height": 430,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Jarrad Turner Sr. has built a career defined by purpose, resilience, and results from the battlefield to the boardroom. A decorated U.S. Army Combat Medic who distinguished himself in Operation Iraqi Freedom, Jarrad has turned his lived experience into a leadership philosophy—utilizing innovation, empathy, and mission-driven execution to address some of the toughest challenges facing the healthcare, government, and enterprise sectors today.\n\nAfter his medical retirement, Jarrad transitioned from military service to national advocacy. As a Senior National Service Officer for the Wounded Warrior Project, he covered Alabama, Georgia, Tennessee, and South Carolina. He worked to secure critical care and benefits for thousands of veterans. In 2018, he co-founded The Warrior Alliance, serving as Vice President and helping build one of the country's most respected nonprofit coalitions focused on veteran reintegration, behavioral health, and coordinated resource delivery. He was pivotal in The Warrior Alliance securing a partnership with the Atlanta Braves Foundation. Currently, the Warrior Alliance covers seven states in what Major League Baseball has designated as Braves Country.\n\nJarrad's expertise also extends into clinical and neurological care. His work with the Shepherd Center's SHARE Military Initiative, a nationally acclaimed program for traumatic brain injury and PTSD treatment, has influenced best practices in holistic veteran care. His continued leadership led to his appointment to the Shepherd's Center Board of Directors in 2022. The Shepherd's Men is a grassroots movement addressing veteran suicide, demonstrating his enduring commitment to advocacy and awareness. The group has raised $10 million to support the treatment of service members, veterans, and first responders at the SHARE Military Initiative.\n\nAs a member of the Shepherd Center Board of Directors, Jarrad helped guide strategic growth in rehabilitation and military care. This role led to his federal appointment to the U.S. Department of Veterans Affairs Advisory Committee on Disability Compensation, where he advises on national policy impacting millions of veterans. Most recently, in 2026, he will be named to the Advisory Board for Morehouse School of Medicine, helping shape the future of healthcare equity and innovation.\n\nJarrad served as the CEO of Veterans Technology Solutions USA, a veteran-led, mission-focused IT and cybersecurity firm specializing in AI-powered solutions, secure data infrastructure, and digital transformation. Under his leadership, VTS-USA partnered with government agencies, healthcare systems, and Fortune 500 companies to deliver tailored, high-impact technology strategies that improve outcomes, enhance resilience, and drive operational efficiency.\n\nSeeing a need, Jarrad founded Pioneer AI Health in early 2025. Pioneer AI Health has developed an app called Pioneer Vitals, which addresses the mental health needs of Veterans and First Responders who have been exposed to prolonged trauma as a result of their occupation. This app partners with national medical providers to ensure the mental health needs of the brave men and women who protect us daily are always met.\n\nRenowned for bringing together high-performing, cross-functional teams, Jarrad has a proven track record of aligning people, process, and purpose to solve complex challenges at scale. He holds an Executive Nonprofit Leadership Certificate from the University of Georgia and an Executive Entrepreneurial Certificate from Babson College, reflecting his deep commitment to strategic leadership and sustainable impact. Jarrad Turner Sr. brings executive expertise and an unwavering sense of purpose to every partnership, earning the trust of organizations that share his conviction that the right team can achieve the extraordinary through innovative processes and measured impact.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/jarrad-turner-sr-9959b2b/"
            }
        ]
    },
    {
        "id": 4,
        "name": "Christina Morillo",
        "slug": "christina-morillo",
        "path": "/team/christina-morillo",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1756404227/ChristinaMorillo_lfnwgo.jpg",
            "width": 350,
            "height": 430,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Christina Morillo is a seasoned cybersecurity and technology executive with over 20 years of cross-domain experience leading enterprise security, cloud architecture, and identity programs. As a CISO and trusted advisor, she blends technical depth with strategic leadership to drive resilience, regulatory alignment, and business impact. Her career spans diverse industries, including financial services, big tech, and professional sports, bringing a unique perspective to every challenge. Christina is also a published O'Reilly author (Zero Trust Networks: Second Edition, 97 Things Every Information Security Professional Should Know) and is passionate about making security and technology accessible, inclusive, and actionable for all.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/christinamorillo/"
            },
            {
                "label": "Website",
                "icon": "fas fa-globe",
                "url": "https://www.christinamorillo.com/"
            }
        ]
    },
    {
        "id": 5,
        "name": "Alex Reyes",
        "slug": "alex-reyes",
        "path": "/team/alex-reyes",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1764282207/2025_02_10_TA_Headshots_015_vxexmt.png",
            "width": 350,
            "height": 430,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Alex Reyes is a seasoned Recruiting Leader and Career Coach with nearly 20 years of experience in Talent Acquisition and 13 years of distinguished Military Service. Currently leading talent acquisition at UC Davis Campus, Alex specializes in delivering both technical and non-technical staffing solutions, while building scalable infrastructure that enhances efficiency and empowers high-performing teams.\n\nAs a Career Coach, Alex has a proven track record of mentoring professionals across diverse fields—including Product Management, Data Analytics, and Software Engineering (Full Stack, Infrastructure, Machine Learning, Mobile, and Front End). Since 2023, Alex has helped candidates land roles at top-tier companies such as TikTok, Apple, Meta, and Microsoft.\n\nDriven by a deep commitment to helping others succeed, Alex equips clients with actionable strategies for career advancement through targeted interview preparation and communication skills training. His coaching fosters self-confidence and prepares individuals to navigate career transitions successfully, excel in job searches, and achieve their professional goals.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/alexreyes27/"
            }
        ]
    },
    {
        "id": 6,
        "name": "Natalia Bailey",
        "slug": "natalia-bailey",
        "path": "/team/natalia-bailey",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771193144/team/natalia-bailey.png",
            "width": 742,
            "height": 990,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Natalia Bailey is an IT and data analytics leader who specializes in building clear, ethical, and scalable analytics programs. A U.S. Army veteran and former Signal Officer, she brings mission discipline and empathy to complex technical efforts. At PulteGroup, Natalia manages enterprise analytics and platform modernization; embedding business processes into analytics. She leads data governance implementation and program management integrating data discovery with transparency and security at the center.\n\nBefore PulteGroup, Natalia was a senior consultant at Slalom, where she implemented data governance for mid- and large-size organizations across sectors such as automotive, manufacturing, non-profit, public sector, and construction. Her focus: build trust and transparency in data without breaking the bank, so teams can surface actionable insights and make better decisions. There she created the RAISE Framework (Risk Assessment, AI Integration, Sustainable Efficiency), guiding responsible AI adoption with data quality, privacy, and governance foundations.\n\nShe holds master's degrees in Information Technology Management and Business Administration. She is active in the Atlanta veteran community and passionate about helping veterans reintegrate back into civilian life by translating military problem-solving into modern technical careers through project-based learning, mentorship, and community building.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/nataliabailey/"
            }
        ]
    },
    {
        "id": 7,
        "name": "Ken Wheeler",
        "slug": "ken-wheeler",
        "path": "/team/ken-wheeler",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771200642/team/ken-wheeler.jpg",
            "width": 180,
            "height": 180,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Ken Wheeler is a software developer with over a decade of experience in creating web applications for large clients. He has spent a large amount of his career working in e-commerce, custom enterprise application development and more recently, the fintech space. He primarily works in Javascript, but is comfortable and productive in several languages.\n\nA large part of his recent experience has been being a part of core architecture teams, where he has focused on application architecture, internal training, external training, performance optimization and coordinating organizational practices across vertical teams.\n\nAdjacent to this work, Ken has also traveled the world speaking at a variety of conferences and giving workshops. He has also written and maintained a number of popular open source projects, most notably Slick Carousel and Webpack Dashboard.\n\nHis independent study and free time interests generally lie in explorations and prototyping related to what the next web could look like, the exploration of Rust, OCaml/ReasonML, applications of machine/deep learning, and WebAudio/WebGL.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/kennywheeler/"
            },
            {
                "label": "GitHub",
                "icon": "fab fa-github",
                "url": "https://github.com/kenwheeler"
            }
        ]
    },
    {
        "id": 8,
        "name": "Rachel Polish",
        "slug": "rachel-polish",
        "path": "/team/rachel-polish",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771201515/team/rachel-polish.jpg",
            "width": 272,
            "height": 300,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Rachel Polish is a dynamic Senior Digital Media Sales and Marketing Lead with 15+ years of experience as a partner for paid/owned/earned digital strategic plans and crisis management programs, supporting brands like JPMorgan Chase and agencies like Ogilvy Public Relations. She is an expert in measurement, online listening, and audience development, with deep B2B and B2C insights/KPI experience. Skilled in building strong client relationships, developing tailored narratives, pitch presentations, and initiatives that align client goals and KPIs with digital solutions, Rachel is a passionate advocate for client needs, demonstrating value through focused, measurable campaigns.\n\nAs a Coast Guard Reservist, Rachel is privileged to serve as the senior enlisted leader for a diverse unit spanning multiple missions and special operations, providing strategic leadership, mentorship, advocacy, and training opportunities to 150+ Reserve personnel.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/rachelpolish/"
            }
        ]
    },
    {
        "id": 10,
        "name": "Tim Banks",
        "slug": "tim-banks",
        "path": "/team/tim-banks",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771204083/team/tim-banks.jpg",
            "width": 460,
            "height": 460,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Tim Banks' tech career spans over 25 years through various sectors. His initial journey into tech started in avionics in the US Marine Corps and then into various government contracting roles. After moving to the private sector, Tim worked both in large corporate environments and in small startups, honing his skills in systems administration, automation, architecture, and operations for large cloud-based datastores. Today, Tim leverages his years in operations, DevOps, and Site Reliability Engineering to advise and consult with the open source and cloud computing communities. Tim is also a competitive Brazilian Jiu-Jitsu practitioner. He is the 2-time American National and is the 5-time Pan American Brazilian Jiu-Jitsu champion in his division.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/timjb/"
            },
            {
                "label": "GitHub",
                "icon": "fab fa-github",
                "url": "https://github.com/timbanks"
            }
        ]
    },
    {
        "id": 11,
        "name": "Emily Freeman",
        "slug": "emily-freeman",
        "path": "/team/emily-freeman",
        "url": "",
        "image": {
            "src": "https://res.cloudinary.com/vetswhocode/image/upload/v1771205532/team/emily-freeman.webp",
            "width": 2500,
            "height": 1237,
            "alt": "Board Member"
        },
        "designation": "Board Member",
        "bio": "Emily Freeman is a bestselling author, public speaker, and technical leader who believes tech's biggest challenges are human, not technical. Her mission centers on building collaborative, diverse team cultures grounded in empathy, kindness, and respect. She is the author of DevOps for Dummies and 97 Things Every Cloud Engineer Should Know.",
        "socials": [
            {
                "label": "LinkedIn",
                "icon": "fab fa-linkedin",
                "url": "https://www.linkedin.com/in/editingemily/"
            },
            {
                "label": "GitHub",
                "icon": "fab fa-github",
                "url": "https://github.com/emilyfreeman"
            },
            {
                "label": "Website",
                "icon": "fas fa-globe",
                "url": "https://emilyfreeman.io/"
            }
        ]
    }
]